/*
    Plugin-SDK (Grand Theft Auto 3) header file
    Authors: GTA Community. See more here
    https://github.com/DK22Pac/plugin-sdk
    Do not delete this comment block. Respect others' work!
*/
#pragma once

#include "PluginBase.h"
#include "CPlaceable.h"
#include "CCam.h"
#include "CGarage.h"
#include "CVector.h"
#include "RenderWare.h"
#include "CEntity.h"
#include "CPathSplines.h"
#include "CTrainCamNode.h"
#include "CMatrix.h"

enum PLUGIN_API eCamControl {
    CAMCONTROL_GAME = 0,
    CAMCONTROL_SCRIPT = 1,
    CAMCONTROL_OBBE = 2
};

struct PLUGIN_API CQueuedMode {
    short Mode;
    float Duration;
    short MinZoom;
    short MaxZoom;
};
VALIDATE_OFFSET(CQueuedMode, Mode, 0x0);
VALIDATE_OFFSET(CQueuedMode, Duration, 0x4);
VALIDATE_OFFSET(CQueuedMode, MinZoom, 0x8);
VALIDATE_OFFSET(CQueuedMode, MaxZoom, 0xA);
VALIDATE_SIZE(CQueuedMode, 0xC);

class PLUGIN_API CCamera : public CPlaceable {
    PLUGIN_NO_DEFAULT_CONSTRUCTION(CCamera)

public:
    bool m_bAboveGroundTrainNodesLoaded;
    bool m_bBelowGroundTrainNodesLoaded;
    bool m_bCamDirectlyBehind;
    bool m_bCamDirectlyInFront;
    bool m_bCameraJustRestored;
    bool m_bCutsceneFinished;
    bool m_bCullZoneChecksOn;
    bool m_bFirstPersonBeingUsed;
    bool m_bJustJumpedOutOf1stPersonBecauseOfTarget;
    bool m_bIdleOn;
    bool m_bInATunnelAndABigVehicle;
    bool m_bInitialNodeFound;
    bool m_bInitialNoNodeStaticsSet;
    bool m_bIgnoreFadingStuffForMusic;
    bool m_bPlayerIsInGarage;
    bool m_bJustCameOutOfGarage;
    bool m_bJustInitalised;
    bool m_bJust_Switched;
    bool m_bLookingAtPlayer;
    bool m_bLookingAtVector;
    bool m_bMoveCamToAvoidGeom;
    bool m_bObbeCinematicPedCamOn;
    bool m_bObbeCinematicCarCamOn;
    bool m_bRestoreByJumpCut;
    bool m_bUseNearClipScript;
    bool m_bStartInterScript;
    bool m_bStartingSpline;
    bool m_bTargetJustBeenOnTrain;
    bool m_bTargetJustCameOffTrain;
    bool m_bUseSpecialFovTrain;
    bool m_bUseTransitionBeta;
    bool m_bUseScriptZoomValuePed;
    bool m_bUseScriptZoomValueCar;
    bool m_bWaitForInterpolToFinish;
    bool m_bItsOkToLookJustAtThePlayer;
    bool m_bWantsToSwitchWidescreenOff;
    bool m_bWideScreenOn;
    bool m_b1rstPersonRunCloseToAWall;
    bool m_bHeadBob;
    bool m_bFailedCullZoneTestPreviously;
    bool m_bFadeTargetIsSplashScreen;
    bool m_bWorldViewerBeingUsed;
    unsigned char m_nActiveCam;
    unsigned int m_nCamShakeStart;
    unsigned int m_nFirstPersonCamLastInputTime;
    unsigned int m_nLongestTimeInMill;
    unsigned int m_nNumberOfTrainCamNodes;
    unsigned char m_nTransitionJUSTStarted;
    unsigned char m_nTransitionState; //!< 0:one mode 1:transition
    unsigned int m_nTimeLastChange;
    unsigned int m_nTimeWeEnteredIdle;
    unsigned int m_nTimeTransitionStart;
    unsigned int m_nTransitionDuration;
    int m_nBlurBlue;
    int m_nBlurGreen;
    int m_nBlurRed;
    int m_nBlurType;
    int field_AC; //!< some counter having to do with music
    int m_nWorkOutSpeedThisNumFrames;
    int m_nNumFramesSoFar;
    int m_nCurrentTrainCamNode;
    int m_nMotionBlur;
    int m_nMotionBlurAddAlpha;
    int m_nCheckCullZoneThisNumFrames;
    int m_nZoneCullFrameNumWereAt;
    int m_nWhoIsInControlOfTheCamera;
    float m_fCamFrontXNorm;
    float m_fCamFrontYNorm;
    float m_fCarZoomIndicator;
    float m_fCarZoomValue;
    float m_fCarZoomValueSmooth;
    float m_fDistanceToWater;
    float m_fFOVDuringInter;
    float m_fLODDistMultiplier;
    float m_fGenerationDistMultiplier;
    float m_fAlphaSpeedAtStartInter;
    float m_fAlphaWhenInterPol;
    float m_fAlphaDuringInterPol;
    float m_fBetaDuringInterPol;
    float m_fBetaSpeedAtStartInter;
    float m_fBetaWhenInterPol;
    float m_fFOVWhenInterPol;
    float m_fFOVSpeedAtStartInter;
    float m_fStartingBetaForInterPol;
    float m_fStartingAlphaForInterPol;
    float m_fPedOrientForBehindOrInFront;
    float m_fCameraAverageSpeed;
    float m_fCameraSpeedSoFar;
    float m_fCamShakeForce;
    float m_fCarZoomValueScript;
    float m_fFovForTrain;
    float m_fFOVWideScreen;
    float m_fNearClipScript;
    float m_fOldBetaDiff;
    float m_fPedZoomValue;
    float m_fPedZoomValueScript;
    float m_fPedZoomValueSmooth;
    float m_fPositionAlongSpline;
    float m_fScreenReductionPercentage;
    float m_fScreenReductionSpeed;
    float m_fAlphaForPlayerAnim1rstPerson;
    float m_fOrientation;
    float m_fPedZoomIndicator;
    float m_fPlayerExhaustion;
    float m_fSoundDistUp;
    float m_fSoundDistLeft;
    float m_fSoundDistRight;
    float m_fSoundDistUpAsRead;
    float m_fSoundDistLeftAsRead;
    float m_fSoundDistRightAsRead;
    float m_fSoundDistUpAsReadOld;
    float m_fSoundDistLeftAsReadOld;
    float m_fSoundDistRightAsReadOld;
    float m_fWideScreenReductionAmount;
    float m_fStartingFOVForInterPol;
    float m_fMouseAccelHorzntal; //!< acceleration multiplier for 1st person controls
    float m_fMouseAccelVertical; //!< acceleration multiplier for 1st person controls
    float m_f3rdPersonCHairMultX;
    float m_f3rdPersonCHairMultY;
    CCam m_asCams[3];
    CGarage *m_pToGarageWeAreIn;
    CGarage *m_pToGarageWeAreInForHackAvoidFirstPerson;
    CQueuedMode m_PlayerMode;
    CQueuedMode m_PlayerWeaponMode;
    CVector m_vecPreviousCameraPosition;
    CVector m_vecRealPreviousCameraPosition;
    CVector m_vecAimingTargetCoors;
    CVector m_vecFixedModeVector;
    CVector m_vecFixedModeSource;
    CVector m_vecFixedModeUpOffSet;
    CVector m_vCamCutSceneOffset;
    CVector m_vecStartingSourceForInterPol;
    CVector m_vecStartingTargetForInterPol;
    CVector m_vecStartingUpForInterPol;
    CVector m_vecSourceSpeedAtStartInter;
    CVector m_vecTargetSpeedAtStartInter;
    CVector m_vecUpSpeedAtStartInter;
    CVector m_vecSourceWhenInterPol;
    CVector m_vecTargetWhenInterPol;
    CVector m_vecUpWhenInterPol;
    CVector m_vecGameCamPos;
    CVector m_vecSourceDuringInter;
    CVector m_vecTargetDuringInter;
    CVector m_vecUpDuringInter;
    RwCamera *m_pRwCamera;
    CEntity *m_pTargetEntity;
    CPathSplines m_aPathSplines[4];
    CTrainCamNode m_aTrainCamNodes[800];
    CMatrix m_CameraMatrix;
    bool m_bGarageFixedCamPositionSet;
    bool m_bDoingSpecialInterPolation;
    bool m_bScriptParametersSetForInterPol;
    bool m_bFading;
    bool m_bMusicFading;
    CMatrix m_ViewMatrix;
    CVector m_avecFrustumNormals[4];
    CVector m_vecOldSourceForInter;
    CVector m_vecOldFrontForInter;
    CVector m_vecOldUpForInter;
    float m_fOldFOVForInter;
    float m_fFLOATingFade;
    float m_fFLOATingFadeMusic;
    float m_fTimeToFadeOut;
    float m_fTimeToFadeMusic;
    float m_fFractionInterToStopMoving;
    float m_fFractionInterToStopCatchUp;
    float m_fGaitSwayBuffer;
    float m_fScriptPercentageInterToStopMoving;
    float m_fScriptPercentageInterToCatchUp;
    unsigned int m_nScriptTimeForInterPolation;
    short m_nFadingDirection;
    int m_nModeObbeCamIsInForCar;
    short m_nModeToGoTo;
    short m_nMusicFadingDirection;
    short m_nTypeOfSwitch;
    unsigned int m_nFadeTimeStarted;
    unsigned int m_nFadeTimeStartedMusic;

    SUPPORTED_10EN_11EN_STEAM static bool &m_bUseMouse3rdPerson;

    // virtual function #0 (destructor)


    SUPPORTED_10EN_11EN_STEAM void CalculateDerivedValues();
    SUPPORTED_10EN_11EN_STEAM void CamControl();
    SUPPORTED_10EN_11EN_STEAM void CamShake(float strength, float x, float y, float z);
    SUPPORTED_10EN_11EN_STEAM void ClearPlayerWeaponMode();
    SUPPORTED_10EN_11EN_STEAM void DontProcessObbeCinemaCamera();
    SUPPORTED_10EN_11EN_STEAM void DrawBordersForWideScreen();
    SUPPORTED_10EN_11EN_STEAM void Fade(float timeOut, short direction);
    SUPPORTED_10EN_11EN_STEAM void Find3rdPersonCamTargetVector(float dist, CVector pos, CVector &source, CVector &target);
    SUPPORTED_10EN_11EN_STEAM float Find3rdPersonQuickAimPitch();
    SUPPORTED_10EN_11EN_STEAM void FinishCutscene();
    SUPPORTED_10EN_11EN_STEAM CMatrix *GetCameraMatrix();
    SUPPORTED_10EN_11EN_STEAM unsigned int GetCutSceneFinishTime();
    SUPPORTED_10EN_11EN_STEAM bool GetFading();
    SUPPORTED_10EN_11EN_STEAM int GetFadingDirection();
    SUPPORTED_10EN_11EN_STEAM CVector *GetGameCamPosition();
    SUPPORTED_10EN_11EN_STEAM int GetLookDirection();
    SUPPORTED_10EN_11EN_STEAM bool GetLookingForwardFirstPerson();
    SUPPORTED_10EN_11EN_STEAM bool GetLookingLRBFirstPerson();
    SUPPORTED_10EN_11EN_STEAM float GetPositionAlongSpline();
    SUPPORTED_10EN_11EN_STEAM int GetScreenFadeStatus();
    SUPPORTED_10EN_11EN_STEAM bool Get_Just_Switched_Status();
    SUPPORTED_10EN_11EN_STEAM void Init();
    SUPPORTED_10EN_11EN_STEAM void InitialiseCameraForDebugMode();
    SUPPORTED_10EN_11EN_STEAM bool IsItTimeForNewcam(int obbeMode, int time);
    SUPPORTED_10EN_11EN_STEAM bool IsSphereVisible(CVector const &center, float radius, CMatrix const *matrix);
    SUPPORTED_10EN_11EN_STEAM bool IsSphereVisible(CVector const &center, float radius);
    SUPPORTED_10EN_11EN_STEAM void LoadPathSplines(int file);
    SUPPORTED_10EN_11EN_STEAM void LoadTrainCamNodes(char const *name);
    SUPPORTED_10EN_11EN_STEAM void Process();
    SUPPORTED_10EN_11EN_STEAM void ProcessFade();
    SUPPORTED_10EN_11EN_STEAM void ProcessMusicFade();
    SUPPORTED_10EN_11EN_STEAM void ProcessObbeCinemaCameraCar();
    SUPPORTED_10EN_11EN_STEAM void ProcessObbeCinemaCameraPed();
    SUPPORTED_10EN_11EN_STEAM void ProcessWideScreenOn();
    SUPPORTED_10EN_11EN_STEAM void Process_Train_Camera_Control();
    SUPPORTED_10EN_11EN_STEAM void RenderMotionBlur();
    SUPPORTED_10EN_11EN_STEAM void Restore();
    SUPPORTED_10EN_11EN_STEAM void RestoreWithJumpCut();
    SUPPORTED_10EN_11EN_STEAM void SetCamCutSceneOffSet(CVector const &pos);
    SUPPORTED_10EN_11EN_STEAM void SetCamPositionForFixedMode(CVector const &source, CVector const &offset);
    SUPPORTED_10EN_11EN_STEAM void SetCameraDirectlyBehindForFollowPed_CamOnAString();
    SUPPORTED_10EN_11EN_STEAM void SetCameraDirectlyInFrontForFollowPed_CamOnAString();
    SUPPORTED_10EN_11EN_STEAM void SetFadeColour(unsigned char red, unsigned char green, unsigned char blue);
    SUPPORTED_10EN_11EN_STEAM void SetMotionBlur(int red, int green, int blue, int value, int type);
    SUPPORTED_10EN_11EN_STEAM void SetMotionBlurAlpha(int alpha);
    SUPPORTED_10EN_11EN_STEAM void SetNearClipScript(float clip);
    SUPPORTED_10EN_11EN_STEAM void SetNewPlayerWeaponMode(short mode, short minZoom, short maxZoom);
    SUPPORTED_10EN_11EN_STEAM void SetParametersForScriptInterpolation(float stopMoving, float catchUp, unsigned int time);
    SUPPORTED_10EN_11EN_STEAM void SetPercentAlongCutScene(float percent);
    SUPPORTED_10EN_11EN_STEAM void SetRwCamera(RwCamera *rwCamera);
    SUPPORTED_10EN_11EN_STEAM void SetWideScreenOff();
    SUPPORTED_10EN_11EN_STEAM void SetWideScreenOn();
    SUPPORTED_10EN_11EN_STEAM void SetZoomValueCamStringScript(short dist);
    SUPPORTED_10EN_11EN_STEAM void SetZoomValueFollowPedScript(short dist);
    SUPPORTED_10EN_11EN_STEAM void StartTransition(short newMode);
    SUPPORTED_10EN_11EN_STEAM void StartTransitionWhenNotFinishedInter(short mode);
    SUPPORTED_10EN_11EN_STEAM void StoreValuesDuringInterPol(CVector &source, CVector &target, CVector &up, float *fov);
    SUPPORTED_10EN_11EN_STEAM void TakeControl(CEntity *target, short mode, short typeOfSwitch, int controller);
    SUPPORTED_10EN_11EN_STEAM void TakeControlNoEntity(CVector const &pos, short typeOfSwitch, int controller);
    SUPPORTED_10EN_11EN_STEAM void TakeControlWithSpline(short typeOfSwitch);
    SUPPORTED_10EN_11EN_STEAM bool TryToStartNewCamMode(int obbeMode);
    SUPPORTED_10EN_11EN_STEAM void UpdateAimingCoors(CVector const &coors);
    SUPPORTED_10EN_11EN_STEAM void UpdateSoundDistances();
    SUPPORTED_10EN_11EN_STEAM void UpdateTargetEntity();
};
VALIDATE_OFFSET(CCamera, m_bAboveGroundTrainNodesLoaded, 0x4C);
VALIDATE_OFFSET(CCamera, m_bBelowGroundTrainNodesLoaded, 0x4D);
VALIDATE_OFFSET(CCamera, m_bCamDirectlyBehind, 0x4E);
VALIDATE_OFFSET(CCamera, m_bCamDirectlyInFront, 0x4F);
VALIDATE_OFFSET(CCamera, m_bCameraJustRestored, 0x50);
VALIDATE_OFFSET(CCamera, m_bCutsceneFinished, 0x51);
VALIDATE_OFFSET(CCamera, m_bCullZoneChecksOn, 0x52);
VALIDATE_OFFSET(CCamera, m_bFirstPersonBeingUsed, 0x53);
VALIDATE_OFFSET(CCamera, m_bJustJumpedOutOf1stPersonBecauseOfTarget, 0x54);
VALIDATE_OFFSET(CCamera, m_bIdleOn, 0x55);
VALIDATE_OFFSET(CCamera, m_bInATunnelAndABigVehicle, 0x56);
VALIDATE_OFFSET(CCamera, m_bInitialNodeFound, 0x57);
VALIDATE_OFFSET(CCamera, m_bInitialNoNodeStaticsSet, 0x58);
VALIDATE_OFFSET(CCamera, m_bIgnoreFadingStuffForMusic, 0x59);
VALIDATE_OFFSET(CCamera, m_bPlayerIsInGarage, 0x5A);
VALIDATE_OFFSET(CCamera, m_bJustCameOutOfGarage, 0x5B);
VALIDATE_OFFSET(CCamera, m_bJustInitalised, 0x5C);
VALIDATE_OFFSET(CCamera, m_bJust_Switched, 0x5D);
VALIDATE_OFFSET(CCamera, m_bLookingAtPlayer, 0x5E);
VALIDATE_OFFSET(CCamera, m_bLookingAtVector, 0x5F);
VALIDATE_OFFSET(CCamera, m_bMoveCamToAvoidGeom, 0x60);
VALIDATE_OFFSET(CCamera, m_bObbeCinematicPedCamOn, 0x61);
VALIDATE_OFFSET(CCamera, m_bObbeCinematicCarCamOn, 0x62);
VALIDATE_OFFSET(CCamera, m_bRestoreByJumpCut, 0x63);
VALIDATE_OFFSET(CCamera, m_bUseNearClipScript, 0x64);
VALIDATE_OFFSET(CCamera, m_bStartInterScript, 0x65);
VALIDATE_OFFSET(CCamera, m_bStartingSpline, 0x66);
VALIDATE_OFFSET(CCamera, m_bTargetJustBeenOnTrain, 0x67);
VALIDATE_OFFSET(CCamera, m_bTargetJustCameOffTrain, 0x68);
VALIDATE_OFFSET(CCamera, m_bUseSpecialFovTrain, 0x69);
VALIDATE_OFFSET(CCamera, m_bUseTransitionBeta, 0x6A);
VALIDATE_OFFSET(CCamera, m_bUseScriptZoomValuePed, 0x6B);
VALIDATE_OFFSET(CCamera, m_bUseScriptZoomValueCar, 0x6C);
VALIDATE_OFFSET(CCamera, m_bWaitForInterpolToFinish, 0x6D);
VALIDATE_OFFSET(CCamera, m_bItsOkToLookJustAtThePlayer, 0x6E);
VALIDATE_OFFSET(CCamera, m_bWantsToSwitchWidescreenOff, 0x6F);
VALIDATE_OFFSET(CCamera, m_bWideScreenOn, 0x70);
VALIDATE_OFFSET(CCamera, m_b1rstPersonRunCloseToAWall, 0x71);
VALIDATE_OFFSET(CCamera, m_bHeadBob, 0x72);
VALIDATE_OFFSET(CCamera, m_bFailedCullZoneTestPreviously, 0x73);
VALIDATE_OFFSET(CCamera, m_bFadeTargetIsSplashScreen, 0x74);
VALIDATE_OFFSET(CCamera, m_bWorldViewerBeingUsed, 0x75);
VALIDATE_OFFSET(CCamera, m_nActiveCam, 0x76);
VALIDATE_OFFSET(CCamera, m_nCamShakeStart, 0x78);
VALIDATE_OFFSET(CCamera, m_nFirstPersonCamLastInputTime, 0x7C);
VALIDATE_OFFSET(CCamera, m_nLongestTimeInMill, 0x80);
VALIDATE_OFFSET(CCamera, m_nNumberOfTrainCamNodes, 0x84);
VALIDATE_OFFSET(CCamera, m_nTransitionJUSTStarted, 0x88);
VALIDATE_OFFSET(CCamera, m_nTransitionState, 0x89);
VALIDATE_OFFSET(CCamera, m_nTimeLastChange, 0x8C);
VALIDATE_OFFSET(CCamera, m_nTimeWeEnteredIdle, 0x90);
VALIDATE_OFFSET(CCamera, m_nTimeTransitionStart, 0x94);
VALIDATE_OFFSET(CCamera, m_nTransitionDuration, 0x98);
VALIDATE_OFFSET(CCamera, m_nBlurBlue, 0x9C);
VALIDATE_OFFSET(CCamera, m_nBlurGreen, 0xA0);
VALIDATE_OFFSET(CCamera, m_nBlurRed, 0xA4);
VALIDATE_OFFSET(CCamera, m_nBlurType, 0xA8);
VALIDATE_OFFSET(CCamera, field_AC, 0xAC);
VALIDATE_OFFSET(CCamera, m_nWorkOutSpeedThisNumFrames, 0xB0);
VALIDATE_OFFSET(CCamera, m_nNumFramesSoFar, 0xB4);
VALIDATE_OFFSET(CCamera, m_nCurrentTrainCamNode, 0xB8);
VALIDATE_OFFSET(CCamera, m_nMotionBlur, 0xBC);
VALIDATE_OFFSET(CCamera, m_nMotionBlurAddAlpha, 0xC0);
VALIDATE_OFFSET(CCamera, m_nCheckCullZoneThisNumFrames, 0xC4);
VALIDATE_OFFSET(CCamera, m_nZoneCullFrameNumWereAt, 0xC8);
VALIDATE_OFFSET(CCamera, m_nWhoIsInControlOfTheCamera, 0xCC);
VALIDATE_OFFSET(CCamera, m_fCamFrontXNorm, 0xD0);
VALIDATE_OFFSET(CCamera, m_fCamFrontYNorm, 0xD4);
VALIDATE_OFFSET(CCamera, m_fCarZoomIndicator, 0xD8);
VALIDATE_OFFSET(CCamera, m_fCarZoomValue, 0xDC);
VALIDATE_OFFSET(CCamera, m_fCarZoomValueSmooth, 0xE0);
VALIDATE_OFFSET(CCamera, m_fDistanceToWater, 0xE4);
VALIDATE_OFFSET(CCamera, m_fFOVDuringInter, 0xE8);
VALIDATE_OFFSET(CCamera, m_fLODDistMultiplier, 0xEC);
VALIDATE_OFFSET(CCamera, m_fGenerationDistMultiplier, 0xF0);
VALIDATE_OFFSET(CCamera, m_fAlphaSpeedAtStartInter, 0xF4);
VALIDATE_OFFSET(CCamera, m_fAlphaWhenInterPol, 0xF8);
VALIDATE_OFFSET(CCamera, m_fAlphaDuringInterPol, 0xFC);
VALIDATE_OFFSET(CCamera, m_fBetaDuringInterPol, 0x100);
VALIDATE_OFFSET(CCamera, m_fBetaSpeedAtStartInter, 0x104);
VALIDATE_OFFSET(CCamera, m_fBetaWhenInterPol, 0x108);
VALIDATE_OFFSET(CCamera, m_fFOVWhenInterPol, 0x10C);
VALIDATE_OFFSET(CCamera, m_fFOVSpeedAtStartInter, 0x110);
VALIDATE_OFFSET(CCamera, m_fStartingBetaForInterPol, 0x114);
VALIDATE_OFFSET(CCamera, m_fStartingAlphaForInterPol, 0x118);
VALIDATE_OFFSET(CCamera, m_fPedOrientForBehindOrInFront, 0x11C);
VALIDATE_OFFSET(CCamera, m_fCameraAverageSpeed, 0x120);
VALIDATE_OFFSET(CCamera, m_fCameraSpeedSoFar, 0x124);
VALIDATE_OFFSET(CCamera, m_fCamShakeForce, 0x128);
VALIDATE_OFFSET(CCamera, m_fCarZoomValueScript, 0x12C);
VALIDATE_OFFSET(CCamera, m_fFovForTrain, 0x130);
VALIDATE_OFFSET(CCamera, m_fFOVWideScreen, 0x134);
VALIDATE_OFFSET(CCamera, m_fNearClipScript, 0x138);
VALIDATE_OFFSET(CCamera, m_fOldBetaDiff, 0x13C);
VALIDATE_OFFSET(CCamera, m_fPedZoomValue, 0x140);
VALIDATE_OFFSET(CCamera, m_fPedZoomValueScript, 0x144);
VALIDATE_OFFSET(CCamera, m_fPedZoomValueSmooth, 0x148);
VALIDATE_OFFSET(CCamera, m_fPositionAlongSpline, 0x14C);
VALIDATE_OFFSET(CCamera, m_fScreenReductionPercentage, 0x150);
VALIDATE_OFFSET(CCamera, m_fScreenReductionSpeed, 0x154);
VALIDATE_OFFSET(CCamera, m_fAlphaForPlayerAnim1rstPerson, 0x158);
VALIDATE_OFFSET(CCamera, m_fOrientation, 0x15C);
VALIDATE_OFFSET(CCamera, m_fPedZoomIndicator, 0x160);
VALIDATE_OFFSET(CCamera, m_fPlayerExhaustion, 0x164);
VALIDATE_OFFSET(CCamera, m_fSoundDistUp, 0x168);
VALIDATE_OFFSET(CCamera, m_fSoundDistLeft, 0x16C);
VALIDATE_OFFSET(CCamera, m_fSoundDistRight, 0x170);
VALIDATE_OFFSET(CCamera, m_fSoundDistUpAsRead, 0x174);
VALIDATE_OFFSET(CCamera, m_fSoundDistLeftAsRead, 0x178);
VALIDATE_OFFSET(CCamera, m_fSoundDistRightAsRead, 0x17C);
VALIDATE_OFFSET(CCamera, m_fSoundDistUpAsReadOld, 0x180);
VALIDATE_OFFSET(CCamera, m_fSoundDistLeftAsReadOld, 0x184);
VALIDATE_OFFSET(CCamera, m_fSoundDistRightAsReadOld, 0x188);
VALIDATE_OFFSET(CCamera, m_fWideScreenReductionAmount, 0x18C);
VALIDATE_OFFSET(CCamera, m_fStartingFOVForInterPol, 0x190);
VALIDATE_OFFSET(CCamera, m_fMouseAccelHorzntal, 0x194);
VALIDATE_OFFSET(CCamera, m_fMouseAccelVertical, 0x198);
VALIDATE_OFFSET(CCamera, m_f3rdPersonCHairMultX, 0x19C);
VALIDATE_OFFSET(CCamera, m_f3rdPersonCHairMultY, 0x1A0);
VALIDATE_OFFSET(CCamera, m_asCams, 0x1A4);
VALIDATE_OFFSET(CCamera, m_pToGarageWeAreIn, 0x690);
VALIDATE_OFFSET(CCamera, m_pToGarageWeAreInForHackAvoidFirstPerson, 0x694);
VALIDATE_OFFSET(CCamera, m_PlayerMode, 0x698);
VALIDATE_OFFSET(CCamera, m_PlayerWeaponMode, 0x6A4);
VALIDATE_OFFSET(CCamera, m_vecPreviousCameraPosition, 0x6B0);
VALIDATE_OFFSET(CCamera, m_vecRealPreviousCameraPosition, 0x6BC);
VALIDATE_OFFSET(CCamera, m_vecAimingTargetCoors, 0x6C8);
VALIDATE_OFFSET(CCamera, m_vecFixedModeVector, 0x6D4);
VALIDATE_OFFSET(CCamera, m_vecFixedModeSource, 0x6E0);
VALIDATE_OFFSET(CCamera, m_vecFixedModeUpOffSet, 0x6EC);
VALIDATE_OFFSET(CCamera, m_vCamCutSceneOffset, 0x6F8);
VALIDATE_OFFSET(CCamera, m_vecStartingSourceForInterPol, 0x704);
VALIDATE_OFFSET(CCamera, m_vecStartingTargetForInterPol, 0x710);
VALIDATE_OFFSET(CCamera, m_vecStartingUpForInterPol, 0x71C);
VALIDATE_OFFSET(CCamera, m_vecSourceSpeedAtStartInter, 0x728);
VALIDATE_OFFSET(CCamera, m_vecTargetSpeedAtStartInter, 0x734);
VALIDATE_OFFSET(CCamera, m_vecUpSpeedAtStartInter, 0x740);
VALIDATE_OFFSET(CCamera, m_vecSourceWhenInterPol, 0x74C);
VALIDATE_OFFSET(CCamera, m_vecTargetWhenInterPol, 0x758);
VALIDATE_OFFSET(CCamera, m_vecUpWhenInterPol, 0x764);
VALIDATE_OFFSET(CCamera, m_vecGameCamPos, 0x770);
VALIDATE_OFFSET(CCamera, m_vecSourceDuringInter, 0x77C);
VALIDATE_OFFSET(CCamera, m_vecTargetDuringInter, 0x788);
VALIDATE_OFFSET(CCamera, m_vecUpDuringInter, 0x794);
VALIDATE_OFFSET(CCamera, m_pRwCamera, 0x7A0);
VALIDATE_OFFSET(CCamera, m_pTargetEntity, 0x7A4);
VALIDATE_OFFSET(CCamera, m_aPathSplines, 0x7A8);
VALIDATE_OFFSET(CCamera, m_aTrainCamNodes, 0x39A8);
VALIDATE_OFFSET(CCamera, m_CameraMatrix, 0xE8A8);
VALIDATE_OFFSET(CCamera, m_bGarageFixedCamPositionSet, 0xE8F0);
VALIDATE_OFFSET(CCamera, m_bDoingSpecialInterPolation, 0xE8F1);
VALIDATE_OFFSET(CCamera, m_bScriptParametersSetForInterPol, 0xE8F2);
VALIDATE_OFFSET(CCamera, m_bFading, 0xE8F3);
VALIDATE_OFFSET(CCamera, m_bMusicFading, 0xE8F4);
VALIDATE_OFFSET(CCamera, m_ViewMatrix, 0xE8F8);
VALIDATE_OFFSET(CCamera, m_avecFrustumNormals, 0xE940);
VALIDATE_OFFSET(CCamera, m_vecOldSourceForInter, 0xE970);
VALIDATE_OFFSET(CCamera, m_vecOldFrontForInter, 0xE97C);
VALIDATE_OFFSET(CCamera, m_vecOldUpForInter, 0xE988);
VALIDATE_OFFSET(CCamera, m_fOldFOVForInter, 0xE994);
VALIDATE_OFFSET(CCamera, m_fFLOATingFade, 0xE998);
VALIDATE_OFFSET(CCamera, m_fFLOATingFadeMusic, 0xE99C);
VALIDATE_OFFSET(CCamera, m_fTimeToFadeOut, 0xE9A0);
VALIDATE_OFFSET(CCamera, m_fTimeToFadeMusic, 0xE9A4);
VALIDATE_OFFSET(CCamera, m_fFractionInterToStopMoving, 0xE9A8);
VALIDATE_OFFSET(CCamera, m_fFractionInterToStopCatchUp, 0xE9AC);
VALIDATE_OFFSET(CCamera, m_fGaitSwayBuffer, 0xE9B0);
VALIDATE_OFFSET(CCamera, m_fScriptPercentageInterToStopMoving, 0xE9B4);
VALIDATE_OFFSET(CCamera, m_fScriptPercentageInterToCatchUp, 0xE9B8);
VALIDATE_OFFSET(CCamera, m_nScriptTimeForInterPolation, 0xE9BC);
VALIDATE_OFFSET(CCamera, m_nFadingDirection, 0xE9C0);
VALIDATE_OFFSET(CCamera, m_nModeObbeCamIsInForCar, 0xE9C4);
VALIDATE_OFFSET(CCamera, m_nModeToGoTo, 0xE9C8);
VALIDATE_OFFSET(CCamera, m_nMusicFadingDirection, 0xE9CA);
VALIDATE_OFFSET(CCamera, m_nTypeOfSwitch, 0xE9CC);
VALIDATE_OFFSET(CCamera, m_nFadeTimeStarted, 0xE9D0);
VALIDATE_OFFSET(CCamera, m_nFadeTimeStartedMusic, 0xE9D4);
VALIDATE_SIZE(CCamera, 0xE9D8);

SUPPORTED_10EN_11EN_STEAM extern int(&SequenceOfCams)[15]; // int SequenceOfCams[15]
SUPPORTED_10EN_11EN_STEAM extern int(&SequenceOfPedCams)[5]; // int SequenceOfPedCams[5]
SUPPORTED_10EN_11EN_STEAM extern CCamera &TheCamera;
SUPPORTED_10EN_11EN_STEAM extern bool &bDidWeProcessAnyCinemaCam;

SUPPORTED_10EN_11EN_STEAM void CamShakeNoPos(CCamera *camera, float strength);

VALIDATE_SIZE(CQueuedMode, 0xC);
VTABLE_DESC(CCamera, 0x5F0EB8, 1);
VALIDATE_SIZE(CCamera, 0xE9D8);

#include "meta/meta.CCamera.h"
