/*
    Plugin-SDK (Grand Theft Auto IV) header file
    Authors: GTA Community. See more here
    https://github.com/DK22Pac/plugin-sdk
    Do not delete this comment block. Respect others' work!
*/
#pragma once
#include "PluginBase.h"
#include "CSimpleIkManager.h"

class CIkManager : public CSimpleIkManager {
public:
    int field_40;
    char field_44[12];
    rage::Vector4 field_50;
    rage::Vector4 field_60;
    rage::Vector4 field_70;
    rage::Vector3 field_80;
    int field_8C;
    rage::Vector4 field_90;
    rage::Vector4 field_A0;
    rage::Vector3 field_B0;
    char field_BC;
    char field_BD[3];
    int field_C0;
    int field_C4;
    int field_C8;
    int field_CC;
    int field_D0;
    int field_D4;
    int field_D8;
    int field_DC;
    int field_E0;
    int field_E4;
    int field_E8;
    int field_EC;
    int field_F0;
    int field_F4;
    int field_F8;
    int field_FC;
    int field_100;
    int field_104;
    int field_108;
    int field_10C;
    int field_110;
    int field_114;
    int field_118;
    int field_11C;
    int field_120;
    int field_124;
    int field_128;
    int field_12C;
    int field_130;
    int field_134;
    int field_138;
    int field_13C;
    char field_140;
    char field_141[15];
    rage::Vector4 field_150;
    rage::Vector4 field_160;
};
VALIDATE_OFFSET(CIkManager, field_40, 0x40);
VALIDATE_OFFSET(CIkManager, field_44, 0x44);
VALIDATE_OFFSET(CIkManager, field_50, 0x50);
VALIDATE_OFFSET(CIkManager, field_60, 0x60);
VALIDATE_OFFSET(CIkManager, field_70, 0x70);
VALIDATE_OFFSET(CIkManager, field_80, 0x80);
VALIDATE_OFFSET(CIkManager, field_8C, 0x8C);
VALIDATE_OFFSET(CIkManager, field_90, 0x90);
VALIDATE_OFFSET(CIkManager, field_A0, 0xA0);
VALIDATE_OFFSET(CIkManager, field_B0, 0xB0);
VALIDATE_OFFSET(CIkManager, field_BC, 0xBC);
VALIDATE_OFFSET(CIkManager, field_BD, 0xBD);
VALIDATE_OFFSET(CIkManager, field_C0, 0xC0);
VALIDATE_OFFSET(CIkManager, field_C4, 0xC4);
VALIDATE_OFFSET(CIkManager, field_C8, 0xC8);
VALIDATE_OFFSET(CIkManager, field_CC, 0xCC);
VALIDATE_OFFSET(CIkManager, field_D0, 0xD0);
VALIDATE_OFFSET(CIkManager, field_D4, 0xD4);
VALIDATE_OFFSET(CIkManager, field_D8, 0xD8);
VALIDATE_OFFSET(CIkManager, field_DC, 0xDC);
VALIDATE_OFFSET(CIkManager, field_E0, 0xE0);
VALIDATE_OFFSET(CIkManager, field_E4, 0xE4);
VALIDATE_OFFSET(CIkManager, field_E8, 0xE8);
VALIDATE_OFFSET(CIkManager, field_EC, 0xEC);
VALIDATE_OFFSET(CIkManager, field_F0, 0xF0);
VALIDATE_OFFSET(CIkManager, field_F4, 0xF4);
VALIDATE_OFFSET(CIkManager, field_F8, 0xF8);
VALIDATE_OFFSET(CIkManager, field_FC, 0xFC);
VALIDATE_OFFSET(CIkManager, field_100, 0x100);
VALIDATE_OFFSET(CIkManager, field_104, 0x104);
VALIDATE_OFFSET(CIkManager, field_108, 0x108);
VALIDATE_OFFSET(CIkManager, field_10C, 0x10C);
VALIDATE_OFFSET(CIkManager, field_110, 0x110);
VALIDATE_OFFSET(CIkManager, field_114, 0x114);
VALIDATE_OFFSET(CIkManager, field_118, 0x118);
VALIDATE_OFFSET(CIkManager, field_11C, 0x11C);
VALIDATE_OFFSET(CIkManager, field_120, 0x120);
VALIDATE_OFFSET(CIkManager, field_124, 0x124);
VALIDATE_OFFSET(CIkManager, field_128, 0x128);
VALIDATE_OFFSET(CIkManager, field_12C, 0x12C);
VALIDATE_OFFSET(CIkManager, field_130, 0x130);
VALIDATE_OFFSET(CIkManager, field_134, 0x134);
VALIDATE_OFFSET(CIkManager, field_138, 0x138);
VALIDATE_OFFSET(CIkManager, field_13C, 0x13C);
VALIDATE_OFFSET(CIkManager, field_140, 0x140);
VALIDATE_OFFSET(CIkManager, field_141, 0x141);
VALIDATE_OFFSET(CIkManager, field_150, 0x150);
VALIDATE_OFFSET(CIkManager, field_160, 0x160);
VALIDATE_SIZE(CIkManager, 0x170);
