/*
    Plugin-SDK (Grand Theft Auto IV) header file
    Authors: GTA Community. See more here
    https://github.com/DK22Pac/plugin-sdk
    Do not delete this comment block. Respect others' work!
*/
#pragma once
#include "PluginBase.h"
#include "CDynamicEntity.h"

class CPortalTracker : CVirtualBase {
public:
    int field_4;
    int field_8;
    int field_C;
    int field_10;
    int field_14;
    int field_18;
    int field_1C;
    int field_20;
    int field_24;
    int field_28;
    int field_2C;
    int field_30;
    int field_34;
    int field_38;
    char field_3C;
    char field_3D;
    char field_3E;
    char field_3F;
    int field_40;
    char field_44;
    char field_45;
    char field_46;
    char field_47;
    char field_48;
    char field_49;
    char field_4A;
    char field_4B;
};
VALIDATE_OFFSET(CPortalTracker, field_4, 0x4);
VALIDATE_OFFSET(CPortalTracker, field_8, 0x8);
VALIDATE_OFFSET(CPortalTracker, field_C, 0xC);
VALIDATE_OFFSET(CPortalTracker, field_10, 0x10);
VALIDATE_OFFSET(CPortalTracker, field_14, 0x14);
VALIDATE_OFFSET(CPortalTracker, field_18, 0x18);
VALIDATE_OFFSET(CPortalTracker, field_1C, 0x1C);
VALIDATE_OFFSET(CPortalTracker, field_20, 0x20);
VALIDATE_OFFSET(CPortalTracker, field_24, 0x24);
VALIDATE_OFFSET(CPortalTracker, field_28, 0x28);
VALIDATE_OFFSET(CPortalTracker, field_2C, 0x2C);
VALIDATE_OFFSET(CPortalTracker, field_30, 0x30);
VALIDATE_OFFSET(CPortalTracker, field_34, 0x34);
VALIDATE_OFFSET(CPortalTracker, field_38, 0x38);
VALIDATE_OFFSET(CPortalTracker, field_3C, 0x3C);
VALIDATE_OFFSET(CPortalTracker, field_3D, 0x3D);
VALIDATE_OFFSET(CPortalTracker, field_3E, 0x3E);
VALIDATE_OFFSET(CPortalTracker, field_3F, 0x3F);
VALIDATE_OFFSET(CPortalTracker, field_40, 0x40);
VALIDATE_OFFSET(CPortalTracker, field_44, 0x44);
VALIDATE_OFFSET(CPortalTracker, field_45, 0x45);
VALIDATE_OFFSET(CPortalTracker, field_46, 0x46);
VALIDATE_OFFSET(CPortalTracker, field_47, 0x47);
VALIDATE_OFFSET(CPortalTracker, field_48, 0x48);
VALIDATE_OFFSET(CPortalTracker, field_49, 0x49);
VALIDATE_OFFSET(CPortalTracker, field_4A, 0x4A);
VALIDATE_OFFSET(CPortalTracker, field_4B, 0x4B);
VALIDATE_SIZE(CPortalTracker, 0x4C);
