/*
    Plugin-SDK (Grand Theft Auto San Andreas) header file
    Authors: GTA Community. See more here
    https://github.com/DK22Pac/plugin-sdk
    Do not delete this comment block. Respect others' work!
*/
#pragma once
#include "PluginBase.h"
#include "eCamMode.h"
#include "CVector.h"

/* http://code.google.com/p/mtasa-blue/source/browse/tags/1.3.4/MTA10/game_sa/CCamSA.h */

class CEntity;
class CPed;
class CVehicle;

class PLUGIN_API CCam {
public:
    bool          m_bBelowMinDist;
    bool          m_bBehindPlayerDesired;
    bool          m_bCamLookingAtVector;
    bool          m_bCollisionChecksOn;
    bool          m_bFixingBeta;
    bool          m_bTheHeightFixerVehicleIsATrain;
    bool          m_bLookBehindCamWasInFront;
    bool          m_bLookingBehind;
    bool          m_bLookingLeft;
    bool          m_bLookingRight;
    bool          m_bResetStatics;
    bool          m_bRotating;
    eCamMode      m_nMode;
private:
    char _pad[2];
public:
    unsigned int  m_nFinishTime;
    unsigned int  m_nDoCollisionChecksOnFrameNum;
    unsigned int  m_nDoCollisionCheckEveryNumOfFrames;
    unsigned int  m_nFrameNumWereAt;
    unsigned int  m_nRunningVectorArrayPos;
    unsigned int  m_nRunningVectorCounter;
    unsigned int  m_nDirectionWasLooking;
    float         m_fMaxRoleAngle;
    float         m_fRoll;
    float         m_fRollSpeed;
    float         m_fSyphonModeTargetZOffSet;
    float         m_fAmountFractionObscured;
    float         m_fAlphaSpeedOverOneFrame;
    float         m_fBetaSpeedOverOneFrame;
    float         m_fBufferedTargetBeta;
    float         m_fBufferedTargetOrientation;
    float         m_fBufferedTargetOrientationSpeed;
    float         m_fCamBufferedHeight;
    float         m_fCamBufferedHeightSpeed;
    float         m_fCloseInPedHeightOffset;
    float         m_fCloseInPedHeightOffsetSpeed;
    float         m_fCloseInCarHeightOffset;
    float         m_fCloseInCarHeightOffsetSpeed;
    float         m_fDimensionOfHighestNearCar;
    float         m_fDistanceBeforeChanges;
    float         m_fFovSpeedOverOneFrame;
    float         m_fMinDistAwayFromCamWhenInterPolating;
    float         m_fPedBetweenCameraHeightOffset;
    float         m_fPlayerInFrontSyphonAngleOffSet;
    float         m_fRadiusForDead;
    float         m_fRealGroundDist;
    float         m_fTargetBeta;
    float         m_fTimeElapsedFloat;
    float         m_fTilt;
    float         m_fTiltSpeed;
    float         m_fTransitionBeta;
    float         m_fTrueBeta;
    float         m_fTrueAlpha;
    float         m_fInitialPlayerOrientation;
    float         m_fVerticalAngle;
    float         m_fAlphaSpeed;
    float         m_fFOV;
    float         m_fFOVSpeed;
    float         m_fHorizontalAngle;
    float         m_fBetaSpeed;
    float         m_fDistance;
    float         m_fDistanceSpeed;
    float         m_fCaMinDistance;
    float         m_fCaMaxDistance;
    float         m_fSpeedVar;
    float         m_fCameraHeightMultiplier;
    float         m_fTargetZoomGroundOne;
    float         m_fTargetZoomGroundTwo;
    float         m_fTargetZoomGroundThree;
    float         m_fTargetZoomOneZExtra;
    float         m_fTargetZoomTwoZExtra;
    float         m_fTargetZoomTwoInteriorZExtra;
    float         m_fTargetZoomThreeZExtra;
    float         m_fTargetZoomZCloseIn;
    float         m_fMinRealGroundDist;
    float         m_fTargetCloseInDist;
    float         m_fBeta_Targeting;
    float         m_fX_Targetting;
    float         m_fY_Targetting;
    CVehicle     *m_pCarWeAreFocussingOn;
    CVehicle     *m_pCarWeAreFocussingOnI;
    float         m_fCamBumpedHorz;
    float         m_fCamBumpedVert;
    unsigned int  m_nCamBumpedTime;
    CVector       m_vecSourceSpeedOverOneFrame;
    CVector       m_vecTargetSpeedOverOneFrame;
    CVector       m_vecUpOverOneFrame;
    CVector       m_vecTargetCoorsForFudgeInter;
    CVector       m_vecCamFixedModeVector;
    CVector       m_vecCamFixedModeSource;
    CVector       m_vecCamFixedModeUpOffSet;
    CVector       m_vecLastAboveWaterCamPosition;
    CVector       m_vecBufferedPlayerBodyOffset;
    CVector       m_vecFront;
    CVector       m_vecSource;
    CVector       m_vecSourceBeforeLookBehind;
    CVector       m_vecUp;
    CVector       m_avecPreviousVectors[2];
    CVector       m_avecTargetHistoryPos[4];
    unsigned int  m_anTargetHistoryTime[4];
    unsigned int  m_nCurrentHistoryPoints;
    CEntity      *m_pCamTargetEntity;
    float         m_fCameraDistance;
    float         m_fIdealAlpha;
    float         m_fPlayerVelocity;
    CVehicle     *m_pLastCarEntered;
    CPed         *m_pLastPedLookedAt;
    bool          m_bFirstPersonRunAboutActive;
};
VALIDATE_OFFSET(CCam, m_bBelowMinDist, 0x0);
VALIDATE_OFFSET(CCam, m_bBehindPlayerDesired, 0x1);
VALIDATE_OFFSET(CCam, m_bCamLookingAtVector, 0x2);
VALIDATE_OFFSET(CCam, m_bCollisionChecksOn, 0x3);
VALIDATE_OFFSET(CCam, m_bFixingBeta, 0x4);
VALIDATE_OFFSET(CCam, m_bTheHeightFixerVehicleIsATrain, 0x5);
VALIDATE_OFFSET(CCam, m_bLookBehindCamWasInFront, 0x6);
VALIDATE_OFFSET(CCam, m_bLookingBehind, 0x7);
VALIDATE_OFFSET(CCam, m_bLookingLeft, 0x8);
VALIDATE_OFFSET(CCam, m_bLookingRight, 0x9);
VALIDATE_OFFSET(CCam, m_bResetStatics, 0xA);
VALIDATE_OFFSET(CCam, m_bRotating, 0xB);
VALIDATE_OFFSET(CCam, m_nMode, 0xC);
VALIDATE_OFFSET(CCam, m_nFinishTime, 0x10);
VALIDATE_OFFSET(CCam, m_nDoCollisionChecksOnFrameNum, 0x14);
VALIDATE_OFFSET(CCam, m_nDoCollisionCheckEveryNumOfFrames, 0x18);
VALIDATE_OFFSET(CCam, m_nFrameNumWereAt, 0x1C);
VALIDATE_OFFSET(CCam, m_nRunningVectorArrayPos, 0x20);
VALIDATE_OFFSET(CCam, m_nRunningVectorCounter, 0x24);
VALIDATE_OFFSET(CCam, m_nDirectionWasLooking, 0x28);
VALIDATE_OFFSET(CCam, m_fMaxRoleAngle, 0x2C);
VALIDATE_OFFSET(CCam, m_fRoll, 0x30);
VALIDATE_OFFSET(CCam, m_fRollSpeed, 0x34);
VALIDATE_OFFSET(CCam, m_fSyphonModeTargetZOffSet, 0x38);
VALIDATE_OFFSET(CCam, m_fAmountFractionObscured, 0x3C);
VALIDATE_OFFSET(CCam, m_fAlphaSpeedOverOneFrame, 0x40);
VALIDATE_OFFSET(CCam, m_fBetaSpeedOverOneFrame, 0x44);
VALIDATE_OFFSET(CCam, m_fBufferedTargetBeta, 0x48);
VALIDATE_OFFSET(CCam, m_fBufferedTargetOrientation, 0x4C);
VALIDATE_OFFSET(CCam, m_fBufferedTargetOrientationSpeed, 0x50);
VALIDATE_OFFSET(CCam, m_fCamBufferedHeight, 0x54);
VALIDATE_OFFSET(CCam, m_fCamBufferedHeightSpeed, 0x58);
VALIDATE_OFFSET(CCam, m_fCloseInPedHeightOffset, 0x5C);
VALIDATE_OFFSET(CCam, m_fCloseInPedHeightOffsetSpeed, 0x60);
VALIDATE_OFFSET(CCam, m_fCloseInCarHeightOffset, 0x64);
VALIDATE_OFFSET(CCam, m_fCloseInCarHeightOffsetSpeed, 0x68);
VALIDATE_OFFSET(CCam, m_fDimensionOfHighestNearCar, 0x6C);
VALIDATE_OFFSET(CCam, m_fDistanceBeforeChanges, 0x70);
VALIDATE_OFFSET(CCam, m_fFovSpeedOverOneFrame, 0x74);
VALIDATE_OFFSET(CCam, m_fMinDistAwayFromCamWhenInterPolating, 0x78);
VALIDATE_OFFSET(CCam, m_fPedBetweenCameraHeightOffset, 0x7C);
VALIDATE_OFFSET(CCam, m_fPlayerInFrontSyphonAngleOffSet, 0x80);
VALIDATE_OFFSET(CCam, m_fRadiusForDead, 0x84);
VALIDATE_OFFSET(CCam, m_fRealGroundDist, 0x88);
VALIDATE_OFFSET(CCam, m_fTargetBeta, 0x8C);
VALIDATE_OFFSET(CCam, m_fTimeElapsedFloat, 0x90);
VALIDATE_OFFSET(CCam, m_fTilt, 0x94);
VALIDATE_OFFSET(CCam, m_fTiltSpeed, 0x98);
VALIDATE_OFFSET(CCam, m_fTransitionBeta, 0x9C);
VALIDATE_OFFSET(CCam, m_fTrueBeta, 0xA0);
VALIDATE_OFFSET(CCam, m_fTrueAlpha, 0xA4);
VALIDATE_OFFSET(CCam, m_fInitialPlayerOrientation, 0xA8);
VALIDATE_OFFSET(CCam, m_fVerticalAngle, 0xAC);
VALIDATE_OFFSET(CCam, m_fAlphaSpeed, 0xB0);
VALIDATE_OFFSET(CCam, m_fFOV, 0xB4);
VALIDATE_OFFSET(CCam, m_fFOVSpeed, 0xB8);
VALIDATE_OFFSET(CCam, m_fHorizontalAngle, 0xBC);
VALIDATE_OFFSET(CCam, m_fBetaSpeed, 0xC0);
VALIDATE_OFFSET(CCam, m_fDistance, 0xC4);
VALIDATE_OFFSET(CCam, m_fDistanceSpeed, 0xC8);
VALIDATE_OFFSET(CCam, m_fCaMinDistance, 0xCC);
VALIDATE_OFFSET(CCam, m_fCaMaxDistance, 0xD0);
VALIDATE_OFFSET(CCam, m_fSpeedVar, 0xD4);
VALIDATE_OFFSET(CCam, m_fCameraHeightMultiplier, 0xD8);
VALIDATE_OFFSET(CCam, m_fTargetZoomGroundOne, 0xDC);
VALIDATE_OFFSET(CCam, m_fTargetZoomGroundTwo, 0xE0);
VALIDATE_OFFSET(CCam, m_fTargetZoomGroundThree, 0xE4);
VALIDATE_OFFSET(CCam, m_fTargetZoomOneZExtra, 0xE8);
VALIDATE_OFFSET(CCam, m_fTargetZoomTwoZExtra, 0xEC);
VALIDATE_OFFSET(CCam, m_fTargetZoomTwoInteriorZExtra, 0xF0);
VALIDATE_OFFSET(CCam, m_fTargetZoomThreeZExtra, 0xF4);
VALIDATE_OFFSET(CCam, m_fTargetZoomZCloseIn, 0xF8);
VALIDATE_OFFSET(CCam, m_fMinRealGroundDist, 0xFC);
VALIDATE_OFFSET(CCam, m_fTargetCloseInDist, 0x100);
VALIDATE_OFFSET(CCam, m_fBeta_Targeting, 0x104);
VALIDATE_OFFSET(CCam, m_fX_Targetting, 0x108);
VALIDATE_OFFSET(CCam, m_fY_Targetting, 0x10C);
VALIDATE_OFFSET(CCam, m_pCarWeAreFocussingOn, 0x110);
VALIDATE_OFFSET(CCam, m_pCarWeAreFocussingOnI, 0x114);
VALIDATE_OFFSET(CCam, m_fCamBumpedHorz, 0x118);
VALIDATE_OFFSET(CCam, m_fCamBumpedVert, 0x11C);
VALIDATE_OFFSET(CCam, m_nCamBumpedTime, 0x120);
VALIDATE_OFFSET(CCam, m_vecSourceSpeedOverOneFrame, 0x124);
VALIDATE_OFFSET(CCam, m_vecTargetSpeedOverOneFrame, 0x130);
VALIDATE_OFFSET(CCam, m_vecUpOverOneFrame, 0x13C);
VALIDATE_OFFSET(CCam, m_vecTargetCoorsForFudgeInter, 0x148);
VALIDATE_OFFSET(CCam, m_vecCamFixedModeVector, 0x154);
VALIDATE_OFFSET(CCam, m_vecCamFixedModeSource, 0x160);
VALIDATE_OFFSET(CCam, m_vecCamFixedModeUpOffSet, 0x16C);
VALIDATE_OFFSET(CCam, m_vecLastAboveWaterCamPosition, 0x178);
VALIDATE_OFFSET(CCam, m_vecBufferedPlayerBodyOffset, 0x184);
VALIDATE_OFFSET(CCam, m_vecFront, 0x190);
VALIDATE_OFFSET(CCam, m_vecSource, 0x19C);
VALIDATE_OFFSET(CCam, m_vecSourceBeforeLookBehind, 0x1A8);
VALIDATE_OFFSET(CCam, m_vecUp, 0x1B4);
VALIDATE_OFFSET(CCam, m_avecPreviousVectors, 0x1C0);
VALIDATE_OFFSET(CCam, m_avecTargetHistoryPos, 0x1D8);
VALIDATE_OFFSET(CCam, m_anTargetHistoryTime, 0x208);
VALIDATE_OFFSET(CCam, m_nCurrentHistoryPoints, 0x218);
VALIDATE_OFFSET(CCam, m_pCamTargetEntity, 0x21C);
VALIDATE_OFFSET(CCam, m_fCameraDistance, 0x220);
VALIDATE_OFFSET(CCam, m_fIdealAlpha, 0x224);
VALIDATE_OFFSET(CCam, m_fPlayerVelocity, 0x228);
VALIDATE_OFFSET(CCam, m_pLastCarEntered, 0x22C);
VALIDATE_OFFSET(CCam, m_pLastPedLookedAt, 0x230);
VALIDATE_OFFSET(CCam, m_bFirstPersonRunAboutActive, 0x234);
VALIDATE_SIZE(CCam, 0x238);
