/*
    Plugin-SDK (Grand Theft Auto San Andreas Unreal) header file
    Authors: GTA Community. See more here
    https://github.com/DK22Pac/plugin-sdk
    Do not delete this comment block. Respect others' work!
*/
#pragma once
#include "PluginBase.h"

struct CControllerState {
    int16_t LeftStickX;
    int16_t LeftStickY;
    int16_t RightStickX;
    int16_t RightStickY;
    int16_t LeftShoulder1;
    int16_t LeftShoulder2;
    int16_t RightShoulder1;
    int16_t RightShoulder2;
    int16_t DPadUp;
    int16_t DPadDown;
    int16_t DPadLeft;
    int16_t DPadRight;
    int16_t Start;
    int16_t Select;
    int16_t ButtonSquare;
    int16_t ButtonTriangle;
    int16_t ButtonCross;
    int16_t ButtonCircle;
    int16_t ShockButtonL;
    int16_t ShockButtonR;
    int16_t m_bChatIndicated;
    int16_t m_bPedWalk;
    int16_t m_bVehicleMouseLook;
    int16_t m_bRadioTrackSkip;
};
VALIDATE_OFFSET(CControllerState, LeftStickX, 0x0);
VALIDATE_OFFSET(CControllerState, LeftStickY, 0x2);
VALIDATE_OFFSET(CControllerState, RightStickX, 0x4);
VALIDATE_OFFSET(CControllerState, RightStickY, 0x6);
VALIDATE_OFFSET(CControllerState, LeftShoulder1, 0x8);
VALIDATE_OFFSET(CControllerState, LeftShoulder2, 0xA);
VALIDATE_OFFSET(CControllerState, RightShoulder1, 0xC);
VALIDATE_OFFSET(CControllerState, RightShoulder2, 0xE);
VALIDATE_OFFSET(CControllerState, DPadUp, 0x10);
VALIDATE_OFFSET(CControllerState, DPadDown, 0x12);
VALIDATE_OFFSET(CControllerState, DPadLeft, 0x14);
VALIDATE_OFFSET(CControllerState, DPadRight, 0x16);
VALIDATE_OFFSET(CControllerState, Start, 0x18);
VALIDATE_OFFSET(CControllerState, Select, 0x1A);
VALIDATE_OFFSET(CControllerState, ButtonSquare, 0x1C);
VALIDATE_OFFSET(CControllerState, ButtonTriangle, 0x1E);
VALIDATE_OFFSET(CControllerState, ButtonCross, 0x20);
VALIDATE_OFFSET(CControllerState, ButtonCircle, 0x22);
VALIDATE_OFFSET(CControllerState, ShockButtonL, 0x24);
VALIDATE_OFFSET(CControllerState, ShockButtonR, 0x26);
VALIDATE_OFFSET(CControllerState, m_bChatIndicated, 0x28);
VALIDATE_OFFSET(CControllerState, m_bPedWalk, 0x2A);
VALIDATE_OFFSET(CControllerState, m_bVehicleMouseLook, 0x2C);
VALIDATE_OFFSET(CControllerState, m_bRadioTrackSkip, 0x2E);
VALIDATE_SIZE(CControllerState, 0x30);

class CPad {
public:
    CControllerState NewState;
    CControllerState OldState;
    int32_t currentPadId;
    int16_t SteeringLeftRightBuffer[10];
    int32_t DrunkDrivingBufferUsed;
    CControllerState PCTempKeyState;
    CControllerState PCTempJoyState;
    CControllerState PCTempMouseState;
    uint8_t Phase;
    int16_t ShakeDur;
    uint16_t DisablePlayerControls;
    uint8_t ShakeFreq;
    uint8_t JustOutOfFrontEnd;
    float fCruisingSpeed;
    uint8_t bRhythm;
    uint8_t bWheelie;
    uint8_t bStoppie;
    uint8_t bApplyGas;
    uint8_t bApplyBrake;
    uint8_t bLaneCorrection;
    uint8_t bUsingDebugCamera;
    uint8_t bUsingDebugPlayerFreeze;
    uint8_t bHasCheated;
    uint8_t bDisableForbiddenTerr;
    uint8_t bStopRhythmSprites;
    uint8_t bDoorsLocked;
    uint8_t bRegainControl;
    float fBikeStickY;
    uint8_t bApplyBrakes;
    uint8_t bDisablePlayerEnterCar;
    uint8_t bDisablePlayerDuck;
    uint8_t bDisablePlayerFireWeapon;
    uint8_t bDisablePlayerFireWeaponWithL1;
    uint8_t bDisablePlayerCycleWeapon;
    uint8_t bDisablePlayerJump;
    uint8_t bDisablePlayerDisplayVitalStats;
    uint32_t LastTimeTouched;
    int32_t AverageWeapon;
    int32_t AverageEntries;
    uint32_t NoShakeBeforeThis;
    uint8_t NoShakeFreq;
    uint8_t bHasJetPack;
    uint8_t bRocketLocked;
    uint8_t bTrainPassenger;
    uint8_t bSavedForTrain;
    uint8_t bSetSteeringMode;
    uint8_t bSetTouchLayout;
    float m_fAccelX;
    float m_fAccelY;
    float m_fAccelZ;
};
VALIDATE_OFFSET(CPad, NewState, 0x0);
VALIDATE_OFFSET(CPad, OldState, 0x30);
VALIDATE_OFFSET(CPad, currentPadId, 0x60);
VALIDATE_OFFSET(CPad, SteeringLeftRightBuffer, 0x64);
VALIDATE_OFFSET(CPad, DrunkDrivingBufferUsed, 0x78);
VALIDATE_OFFSET(CPad, PCTempKeyState, 0x7C);
VALIDATE_OFFSET(CPad, PCTempJoyState, 0xAC);
VALIDATE_OFFSET(CPad, PCTempMouseState, 0xDC);
VALIDATE_OFFSET(CPad, Phase, 0x10C);
VALIDATE_OFFSET(CPad, ShakeDur, 0x10E);
VALIDATE_OFFSET(CPad, DisablePlayerControls, 0x110);
VALIDATE_OFFSET(CPad, ShakeFreq, 0x112);
VALIDATE_OFFSET(CPad, JustOutOfFrontEnd, 0x113);
VALIDATE_OFFSET(CPad, fCruisingSpeed, 0x114);
VALIDATE_OFFSET(CPad, bRhythm, 0x118);
VALIDATE_OFFSET(CPad, bWheelie, 0x119);
VALIDATE_OFFSET(CPad, bStoppie, 0x11A);
VALIDATE_OFFSET(CPad, bApplyGas, 0x11B);
VALIDATE_OFFSET(CPad, bApplyBrake, 0x11C);
VALIDATE_OFFSET(CPad, bLaneCorrection, 0x11D);
VALIDATE_OFFSET(CPad, bUsingDebugCamera, 0x11E);
VALIDATE_OFFSET(CPad, bUsingDebugPlayerFreeze, 0x11F);
VALIDATE_OFFSET(CPad, bHasCheated, 0x120);
VALIDATE_OFFSET(CPad, bDisableForbiddenTerr, 0x121);
VALIDATE_OFFSET(CPad, bStopRhythmSprites, 0x122);
VALIDATE_OFFSET(CPad, bDoorsLocked, 0x123);
VALIDATE_OFFSET(CPad, bRegainControl, 0x124);
VALIDATE_OFFSET(CPad, fBikeStickY, 0x128);
VALIDATE_OFFSET(CPad, bApplyBrakes, 0x12C);
VALIDATE_OFFSET(CPad, bDisablePlayerEnterCar, 0x12D);
VALIDATE_OFFSET(CPad, bDisablePlayerDuck, 0x12E);
VALIDATE_OFFSET(CPad, bDisablePlayerFireWeapon, 0x12F);
VALIDATE_OFFSET(CPad, bDisablePlayerFireWeaponWithL1, 0x130);
VALIDATE_OFFSET(CPad, bDisablePlayerCycleWeapon, 0x131);
VALIDATE_OFFSET(CPad, bDisablePlayerJump, 0x132);
VALIDATE_OFFSET(CPad, bDisablePlayerDisplayVitalStats, 0x133);
VALIDATE_OFFSET(CPad, LastTimeTouched, 0x134);
VALIDATE_OFFSET(CPad, AverageWeapon, 0x138);
VALIDATE_OFFSET(CPad, AverageEntries, 0x13C);
VALIDATE_OFFSET(CPad, NoShakeBeforeThis, 0x140);
VALIDATE_OFFSET(CPad, NoShakeFreq, 0x144);
VALIDATE_OFFSET(CPad, bHasJetPack, 0x145);
VALIDATE_OFFSET(CPad, bRocketLocked, 0x146);
VALIDATE_OFFSET(CPad, bTrainPassenger, 0x147);
VALIDATE_OFFSET(CPad, bSavedForTrain, 0x148);
VALIDATE_OFFSET(CPad, bSetSteeringMode, 0x149);
VALIDATE_OFFSET(CPad, bSetTouchLayout, 0x14A);
VALIDATE_OFFSET(CPad, m_fAccelX, 0x14C);
VALIDATE_OFFSET(CPad, m_fAccelY, 0x150);
VALIDATE_OFFSET(CPad, m_fAccelZ, 0x154);
VALIDATE_SIZE(CPad, 0x158);

extern CPad* Pads;
