/*
    Plugin-SDK (Grand Theft Auto 2) header file
    Authors: GTA Community. See more here
    https://github.com/DK22Pac/plugin-sdk
    Do not delete this comment block. Respect others' work!
*/
#pragma once
#include "PluginBase.h"

enum eRadioStations {
    STATION_0,
    STATION_1,
    STATION_DOWNTOWN,
    STATION_RESIDENTIAL,
    STATION_INDUSTRIAL,
    STATION_ZAIBATSU,
    STATION_YAKUZA,
    STATION_LOONIE,
    STATION_REDNECK,
    STATION_SCIENTIST,
    STATION_KRISHNA,
    STATION_RUSSIAN
};

struct tAudioObject {
    int type;
    char field_4;
    char field_5;
    char field_6;
    char field_7;
    int field_8;
    void* field_C;
};
VALIDATE_OFFSET(tAudioObject, type, 0x0);
VALIDATE_OFFSET(tAudioObject, field_4, 0x4);
VALIDATE_OFFSET(tAudioObject, field_5, 0x5);
VALIDATE_OFFSET(tAudioObject, field_6, 0x6);
VALIDATE_OFFSET(tAudioObject, field_7, 0x7);
VALIDATE_OFFSET(tAudioObject, field_8, 0x8);
VALIDATE_OFFSET(tAudioObject, field_C, 0xC);
VALIDATE_SIZE(tAudioObject, 0x10);

struct tSound5 {
    int field_0;
    int field_4;
    int field_8;
};
VALIDATE_OFFSET(tSound5, field_0, 0x0);
VALIDATE_OFFSET(tSound5, field_4, 0x4);
VALIDATE_OFFSET(tSound5, field_8, 0x8);
VALIDATE_SIZE(tSound5, 0xC);

struct tSound4 {
    int field_0;
    char field_4;
    char field_5;
    char field_6;
    char field_7;
    short field_8;
    char field_A;
    char field_B;
};
VALIDATE_OFFSET(tSound4, field_0, 0x0);
VALIDATE_OFFSET(tSound4, field_4, 0x4);
VALIDATE_OFFSET(tSound4, field_5, 0x5);
VALIDATE_OFFSET(tSound4, field_6, 0x6);
VALIDATE_OFFSET(tSound4, field_7, 0x7);
VALIDATE_OFFSET(tSound4, field_8, 0x8);
VALIDATE_OFFSET(tSound4, field_A, 0xA);
VALIDATE_OFFSET(tSound4, field_B, 0xB);
VALIDATE_SIZE(tSound4, 0xC);

struct tAudioEntity {
    char used;
    char field_1;
    char field_2;
    char field_3;
    tAudioObject* obj;
    tSound4* alloc;
};
VALIDATE_OFFSET(tAudioEntity, used, 0x0);
VALIDATE_OFFSET(tAudioEntity, field_1, 0x1);
VALIDATE_OFFSET(tAudioEntity, field_2, 0x2);
VALIDATE_OFFSET(tAudioEntity, field_3, 0x3);
VALIDATE_OFFSET(tAudioEntity, obj, 0x4);
VALIDATE_OFFSET(tAudioEntity, alloc, 0x8);
VALIDATE_SIZE(tAudioEntity, 0xC);

struct tSound2 {
    char field_0;
    char field_1;
    char field_2;
    char field_3;
    int field_4_fp;
    tAudioObject field_8;
    int field_18;
};
VALIDATE_OFFSET(tSound2, field_0, 0x0);
VALIDATE_OFFSET(tSound2, field_1, 0x1);
VALIDATE_OFFSET(tSound2, field_2, 0x2);
VALIDATE_OFFSET(tSound2, field_3, 0x3);
VALIDATE_OFFSET(tSound2, field_4_fp, 0x4);
VALIDATE_OFFSET(tSound2, field_8, 0x8);
VALIDATE_OFFSET(tSound2, field_18, 0x18);
VALIDATE_SIZE(tSound2, 0x1C);

struct tSound {
    int field_0;
    char field_4;
    char field_5;
    char field_6;
    char field_7;
    tSound5 field_8;
    int field_14;
    char field_18;
    char field_19;
    char field_1A;
    char field_1B;
    int field_1C;
    int rate;
    unsigned char volume;
    char field_25;
    char field_26;
    char field_27;
    int field_28;
    char field_2C;
    char field_2D;
    char field_2E;
    char field_2F;
    int field_30;
    int field_34;
    int field_38;
    int field_3C;
    char field_40;
    char field_41;
    char field_42;
    char field_43;
    int field_44;
    unsigned int field_48;
    int field_4C;
    char field_50;
    char field_51;
    char field_52;
    char field_53;
    int field_54;
    int field_58;
    tSound* field_5C;
    unsigned char field_60;
    char field_61;
    char field_62;
    char field_63;
    int field_64;
};
VALIDATE_OFFSET(tSound, field_0, 0x0);
VALIDATE_OFFSET(tSound, field_4, 0x4);
VALIDATE_OFFSET(tSound, field_5, 0x5);
VALIDATE_OFFSET(tSound, field_6, 0x6);
VALIDATE_OFFSET(tSound, field_7, 0x7);
VALIDATE_OFFSET(tSound, field_8, 0x8);
VALIDATE_OFFSET(tSound, field_14, 0x14);
VALIDATE_OFFSET(tSound, field_18, 0x18);
VALIDATE_OFFSET(tSound, field_19, 0x19);
VALIDATE_OFFSET(tSound, field_1A, 0x1A);
VALIDATE_OFFSET(tSound, field_1B, 0x1B);
VALIDATE_OFFSET(tSound, field_1C, 0x1C);
VALIDATE_OFFSET(tSound, rate, 0x20);
VALIDATE_OFFSET(tSound, volume, 0x24);
VALIDATE_OFFSET(tSound, field_25, 0x25);
VALIDATE_OFFSET(tSound, field_26, 0x26);
VALIDATE_OFFSET(tSound, field_27, 0x27);
VALIDATE_OFFSET(tSound, field_28, 0x28);
VALIDATE_OFFSET(tSound, field_2C, 0x2C);
VALIDATE_OFFSET(tSound, field_2D, 0x2D);
VALIDATE_OFFSET(tSound, field_2E, 0x2E);
VALIDATE_OFFSET(tSound, field_2F, 0x2F);
VALIDATE_OFFSET(tSound, field_30, 0x30);
VALIDATE_OFFSET(tSound, field_34, 0x34);
VALIDATE_OFFSET(tSound, field_38, 0x38);
VALIDATE_OFFSET(tSound, field_3C, 0x3C);
VALIDATE_OFFSET(tSound, field_40, 0x40);
VALIDATE_OFFSET(tSound, field_41, 0x41);
VALIDATE_OFFSET(tSound, field_42, 0x42);
VALIDATE_OFFSET(tSound, field_43, 0x43);
VALIDATE_OFFSET(tSound, field_44, 0x44);
VALIDATE_OFFSET(tSound, field_48, 0x48);
VALIDATE_OFFSET(tSound, field_4C, 0x4C);
VALIDATE_OFFSET(tSound, field_50, 0x50);
VALIDATE_OFFSET(tSound, field_51, 0x51);
VALIDATE_OFFSET(tSound, field_52, 0x52);
VALIDATE_OFFSET(tSound, field_53, 0x53);
VALIDATE_OFFSET(tSound, field_54, 0x54);
VALIDATE_OFFSET(tSound, field_58, 0x58);
VALIDATE_OFFSET(tSound, field_5C, 0x5C);
VALIDATE_OFFSET(tSound, field_60, 0x60);
VALIDATE_OFFSET(tSound, field_61, 0x61);
VALIDATE_OFFSET(tSound, field_62, 0x62);
VALIDATE_OFFSET(tSound, field_63, 0x63);
VALIDATE_OFFSET(tSound, field_64, 0x64);
VALIDATE_SIZE(tSound, 0x68);

class PLUGIN_API CAudioManager {
public:
    char field_0;
    char field_1;
    char field_2;
    char field_3;
    int field_4;
    unsigned char field_8;
    char field_9;
    char field_A;
    char field_B;
    int field_C;
    unsigned char m_nActiveSamples;
    char field_11;
    char field_12;
    char field_13;
    int m_nSampleRate;
    char field_18;
    char field_19;
    char field_1A;
    char field_1B;
    char m_nSampCount;
    bool m_bSound3d;
    char field_1E;
    char field_1F;
    int field_20;
    unsigned char m_nEffectsVolume;
    unsigned char m_nMusicVolume;
    char field_26;
    char field_27;
    int field_28;
    char field_2C;
    char field_2D;
    char field_2E;
    char field_2F;
    tSound m_sQueueSample;
    unsigned char m_nActiveSampleQueue;
    char field_99;
    char field_9A;
    char field_9B;
    tSound m_asSamples[2][16];
    char m_aSampleQueueIndexTable[2][16];
    char m_aSampleRequestQueuesStatus[2];
    short field_DBE;
    tSound m_asActiveSamples[16];
    int field_1440;
    char field_1444;
    char field_1445;
    char field_1446;
    char field_1447;
    int field_1448;
    int field_144C;
    char field_1450;
    char field_1451;
    char field_1452;
    char field_1453;
    int m_anRandomTable[5];
    int field_1468_v1;
    int field_146C_v2;
    int field_1470_v3;
    short field_1474;
    char field_1476;
    char field_1477;
    int field_1478;
    tAudioEntity m_asAudioEntities[1020];
    unsigned int m_anAudioEntityIndices[1020];
    unsigned int m_nAudioEntitiesTotal;
    int field_5440;
    int field_5444;
    unsigned int m_nFrameCounter;
    tSound2 field_544C[5];
    char field_54D8[5];
    char field_54DD;
    char field_54DE;
    char field_54DF;
    char field_54E0;
    char field_54E1;
    char field_54E2;
    char field_54E3;
    char field_54E4;
    char field_54E5;
    char field_54E6;
    char field_54E7;
    short field_54E8[5];
    unsigned char field_54F2[5];
    char field_54F7[5];
    int field_54FC;
    int field_5500;
    char field_5504;
    char field_5505;
    char field_5506;
    char field_5507;
    int m_nGameAudioEntity;
    tAudioObject m_GameAudioObject;
    int field_551C;
    unsigned char field_5520;
    char field_5521;
    char field_5522;
    char field_5523;
    int field_5524;
    unsigned char field_5528;
    unsigned char field_5529;
    char field_552A;
    char field_552B;
    int field_552C[15];
    char field_5568;
    char field_5569;
    short field_556A;
    short field_556C;
    short field_556E;
    short field_5570;
    short field_5572;
    int field_5574;
};
VALIDATE_OFFSET(CAudioManager, field_0, 0x0);
VALIDATE_OFFSET(CAudioManager, field_1, 0x1);
VALIDATE_OFFSET(CAudioManager, field_2, 0x2);
VALIDATE_OFFSET(CAudioManager, field_3, 0x3);
VALIDATE_OFFSET(CAudioManager, field_4, 0x4);
VALIDATE_OFFSET(CAudioManager, field_8, 0x8);
VALIDATE_OFFSET(CAudioManager, field_9, 0x9);
VALIDATE_OFFSET(CAudioManager, field_A, 0xA);
VALIDATE_OFFSET(CAudioManager, field_B, 0xB);
VALIDATE_OFFSET(CAudioManager, field_C, 0xC);
VALIDATE_OFFSET(CAudioManager, m_nActiveSamples, 0x10);
VALIDATE_OFFSET(CAudioManager, field_11, 0x11);
VALIDATE_OFFSET(CAudioManager, field_12, 0x12);
VALIDATE_OFFSET(CAudioManager, field_13, 0x13);
VALIDATE_OFFSET(CAudioManager, m_nSampleRate, 0x14);
VALIDATE_OFFSET(CAudioManager, field_18, 0x18);
VALIDATE_OFFSET(CAudioManager, field_19, 0x19);
VALIDATE_OFFSET(CAudioManager, field_1A, 0x1A);
VALIDATE_OFFSET(CAudioManager, field_1B, 0x1B);
VALIDATE_OFFSET(CAudioManager, m_nSampCount, 0x1C);
VALIDATE_OFFSET(CAudioManager, m_bSound3d, 0x1D);
VALIDATE_OFFSET(CAudioManager, field_1E, 0x1E);
VALIDATE_OFFSET(CAudioManager, field_1F, 0x1F);
VALIDATE_OFFSET(CAudioManager, field_20, 0x20);
VALIDATE_OFFSET(CAudioManager, m_nEffectsVolume, 0x24);
VALIDATE_OFFSET(CAudioManager, m_nMusicVolume, 0x25);
VALIDATE_OFFSET(CAudioManager, field_26, 0x26);
VALIDATE_OFFSET(CAudioManager, field_27, 0x27);
VALIDATE_OFFSET(CAudioManager, field_28, 0x28);
VALIDATE_OFFSET(CAudioManager, field_2C, 0x2C);
VALIDATE_OFFSET(CAudioManager, field_2D, 0x2D);
VALIDATE_OFFSET(CAudioManager, field_2E, 0x2E);
VALIDATE_OFFSET(CAudioManager, field_2F, 0x2F);
VALIDATE_OFFSET(CAudioManager, m_sQueueSample, 0x30);
VALIDATE_OFFSET(CAudioManager, m_nActiveSampleQueue, 0x98);
VALIDATE_OFFSET(CAudioManager, field_99, 0x99);
VALIDATE_OFFSET(CAudioManager, field_9A, 0x9A);
VALIDATE_OFFSET(CAudioManager, field_9B, 0x9B);
VALIDATE_OFFSET(CAudioManager, m_asSamples, 0x9C);
VALIDATE_OFFSET(CAudioManager, m_aSampleQueueIndexTable, 0xD9C);
VALIDATE_OFFSET(CAudioManager, m_aSampleRequestQueuesStatus, 0xDBC);
VALIDATE_OFFSET(CAudioManager, field_DBE, 0xDBE);
VALIDATE_OFFSET(CAudioManager, m_asActiveSamples, 0xDC0);
VALIDATE_OFFSET(CAudioManager, field_1440, 0x1440);
VALIDATE_OFFSET(CAudioManager, field_1444, 0x1444);
VALIDATE_OFFSET(CAudioManager, field_1445, 0x1445);
VALIDATE_OFFSET(CAudioManager, field_1446, 0x1446);
VALIDATE_OFFSET(CAudioManager, field_1447, 0x1447);
VALIDATE_OFFSET(CAudioManager, field_1448, 0x1448);
VALIDATE_OFFSET(CAudioManager, field_144C, 0x144C);
VALIDATE_OFFSET(CAudioManager, field_1450, 0x1450);
VALIDATE_OFFSET(CAudioManager, field_1451, 0x1451);
VALIDATE_OFFSET(CAudioManager, field_1452, 0x1452);
VALIDATE_OFFSET(CAudioManager, field_1453, 0x1453);
VALIDATE_OFFSET(CAudioManager, m_anRandomTable, 0x1454);
VALIDATE_OFFSET(CAudioManager, field_1468_v1, 0x1468);
VALIDATE_OFFSET(CAudioManager, field_146C_v2, 0x146C);
VALIDATE_OFFSET(CAudioManager, field_1470_v3, 0x1470);
VALIDATE_OFFSET(CAudioManager, field_1474, 0x1474);
VALIDATE_OFFSET(CAudioManager, field_1476, 0x1476);
VALIDATE_OFFSET(CAudioManager, field_1477, 0x1477);
VALIDATE_OFFSET(CAudioManager, field_1478, 0x1478);
VALIDATE_OFFSET(CAudioManager, m_asAudioEntities, 0x147C);
VALIDATE_OFFSET(CAudioManager, m_anAudioEntityIndices, 0x444C);
VALIDATE_OFFSET(CAudioManager, m_nAudioEntitiesTotal, 0x543C);
VALIDATE_OFFSET(CAudioManager, field_5440, 0x5440);
VALIDATE_OFFSET(CAudioManager, field_5444, 0x5444);
VALIDATE_OFFSET(CAudioManager, m_nFrameCounter, 0x5448);
VALIDATE_OFFSET(CAudioManager, field_544C, 0x544C);
VALIDATE_OFFSET(CAudioManager, field_54D8, 0x54D8);
VALIDATE_OFFSET(CAudioManager, field_54DD, 0x54DD);
VALIDATE_OFFSET(CAudioManager, field_54DE, 0x54DE);
VALIDATE_OFFSET(CAudioManager, field_54DF, 0x54DF);
VALIDATE_OFFSET(CAudioManager, field_54E0, 0x54E0);
VALIDATE_OFFSET(CAudioManager, field_54E1, 0x54E1);
VALIDATE_OFFSET(CAudioManager, field_54E2, 0x54E2);
VALIDATE_OFFSET(CAudioManager, field_54E3, 0x54E3);
VALIDATE_OFFSET(CAudioManager, field_54E4, 0x54E4);
VALIDATE_OFFSET(CAudioManager, field_54E5, 0x54E5);
VALIDATE_OFFSET(CAudioManager, field_54E6, 0x54E6);
VALIDATE_OFFSET(CAudioManager, field_54E7, 0x54E7);
VALIDATE_OFFSET(CAudioManager, field_54E8, 0x54E8);
VALIDATE_OFFSET(CAudioManager, field_54F2, 0x54F2);
VALIDATE_OFFSET(CAudioManager, field_54F7, 0x54F7);
VALIDATE_OFFSET(CAudioManager, field_54FC, 0x54FC);
VALIDATE_OFFSET(CAudioManager, field_5500, 0x5500);
VALIDATE_OFFSET(CAudioManager, field_5504, 0x5504);
VALIDATE_OFFSET(CAudioManager, field_5505, 0x5505);
VALIDATE_OFFSET(CAudioManager, field_5506, 0x5506);
VALIDATE_OFFSET(CAudioManager, field_5507, 0x5507);
VALIDATE_OFFSET(CAudioManager, m_nGameAudioEntity, 0x5508);
VALIDATE_OFFSET(CAudioManager, m_GameAudioObject, 0x550C);
VALIDATE_OFFSET(CAudioManager, field_551C, 0x551C);
VALIDATE_OFFSET(CAudioManager, field_5520, 0x5520);
VALIDATE_OFFSET(CAudioManager, field_5521, 0x5521);
VALIDATE_OFFSET(CAudioManager, field_5522, 0x5522);
VALIDATE_OFFSET(CAudioManager, field_5523, 0x5523);
VALIDATE_OFFSET(CAudioManager, field_5524, 0x5524);
VALIDATE_OFFSET(CAudioManager, field_5528, 0x5528);
VALIDATE_OFFSET(CAudioManager, field_5529, 0x5529);
VALIDATE_OFFSET(CAudioManager, field_552A, 0x552A);
VALIDATE_OFFSET(CAudioManager, field_552B, 0x552B);
VALIDATE_OFFSET(CAudioManager, field_552C, 0x552C);
VALIDATE_OFFSET(CAudioManager, field_5568, 0x5568);
VALIDATE_OFFSET(CAudioManager, field_5569, 0x5569);
VALIDATE_OFFSET(CAudioManager, field_556A, 0x556A);
VALIDATE_OFFSET(CAudioManager, field_556C, 0x556C);
VALIDATE_OFFSET(CAudioManager, field_556E, 0x556E);
VALIDATE_OFFSET(CAudioManager, field_5570, 0x5570);
VALIDATE_OFFSET(CAudioManager, field_5572, 0x5572);
VALIDATE_OFFSET(CAudioManager, field_5574, 0x5574);
VALIDATE_SIZE(CAudioManager, 0x5578);

extern CAudioManager& AudioManager;
