/*
    Plugin-SDK (Grand Theft Auto 2) header file
    Authors: GTA Community. See more here
    https://github.com/DK22Pac/plugin-sdk
    Do not delete this comment block. Respect others' work!
*/
#pragma once
#include "PluginBase.h"
#include "CPhysics.h"
#include "CCamera.h"

class CCar;
class CPed;
class CPlayerPed;

enum eDeathReason {
    DEATHREASON_WASTED = 0,
    DEATHREASON_FRIED = 2,
    DEATHREASON_NICKED = 3,
    DEATHREASON_SHOCKED = 4,
    NUM_DEATHREASONS,
};

struct tCounter {
    int value;
    unsigned char field_4;
    unsigned char field_5;
    unsigned char field_6;
    unsigned char field_7;
    unsigned char field_8;
    unsigned char field_9;
    unsigned char field_10;
    unsigned char field_11;
    unsigned char field_12;
    unsigned char field_13;
    unsigned char field_14;
    unsigned char field_15;
    unsigned char field_16;
    unsigned char field_17;
    unsigned char field_18;
    unsigned char field_19;
    int field_20;
    unsigned char field_24;
    unsigned char field_25;
    unsigned char field_26;
    unsigned char field_27;
    unsigned char field_28;
    unsigned char field_29;
    unsigned char field_30;
    unsigned char field_31;
    CPlayerPed* player;
    unsigned char field_36;
    unsigned char field_37;
    unsigned char field_38;
    unsigned char field_39;
    unsigned char field_40;
    unsigned char field_41;
    short field_42;
    short field_44;
    short field_46;
    int field_47;
    unsigned char field_52;
    unsigned char field_53;
    short id;
};
VALIDATE_OFFSET(tCounter, value, 0x0);
VALIDATE_OFFSET(tCounter, field_4, 0x4);
VALIDATE_OFFSET(tCounter, field_5, 0x5);
VALIDATE_OFFSET(tCounter, field_6, 0x6);
VALIDATE_OFFSET(tCounter, field_7, 0x7);
VALIDATE_OFFSET(tCounter, field_8, 0x8);
VALIDATE_OFFSET(tCounter, field_9, 0x9);
VALIDATE_OFFSET(tCounter, field_10, 0xA);
VALIDATE_OFFSET(tCounter, field_11, 0xB);
VALIDATE_OFFSET(tCounter, field_12, 0xC);
VALIDATE_OFFSET(tCounter, field_13, 0xD);
VALIDATE_OFFSET(tCounter, field_14, 0xE);
VALIDATE_OFFSET(tCounter, field_15, 0xF);
VALIDATE_OFFSET(tCounter, field_16, 0x10);
VALIDATE_OFFSET(tCounter, field_17, 0x11);
VALIDATE_OFFSET(tCounter, field_18, 0x12);
VALIDATE_OFFSET(tCounter, field_19, 0x13);
VALIDATE_OFFSET(tCounter, field_20, 0x14);
VALIDATE_OFFSET(tCounter, field_24, 0x18);
VALIDATE_OFFSET(tCounter, field_25, 0x19);
VALIDATE_OFFSET(tCounter, field_26, 0x1A);
VALIDATE_OFFSET(tCounter, field_27, 0x1B);
VALIDATE_OFFSET(tCounter, field_28, 0x1C);
VALIDATE_OFFSET(tCounter, field_29, 0x1D);
VALIDATE_OFFSET(tCounter, field_30, 0x1E);
VALIDATE_OFFSET(tCounter, field_31, 0x1F);
VALIDATE_OFFSET(tCounter, player, 0x20);
VALIDATE_OFFSET(tCounter, field_36, 0x24);
VALIDATE_OFFSET(tCounter, field_37, 0x25);
VALIDATE_OFFSET(tCounter, field_38, 0x26);
VALIDATE_OFFSET(tCounter, field_39, 0x27);
VALIDATE_OFFSET(tCounter, field_40, 0x28);
VALIDATE_OFFSET(tCounter, field_41, 0x29);
VALIDATE_OFFSET(tCounter, field_42, 0x2A);
VALIDATE_OFFSET(tCounter, field_44, 0x2C);
VALIDATE_OFFSET(tCounter, field_46, 0x2E);
VALIDATE_OFFSET(tCounter, field_47, 0x30);
VALIDATE_OFFSET(tCounter, field_52, 0x34);
VALIDATE_OFFSET(tCounter, field_53, 0x35);
VALIDATE_OFFSET(tCounter, id, 0x36);
VALIDATE_SIZE(tCounter, 0x38);

class PLUGIN_API CPlayerPed {
public:
    bool field_0;
    char field_1;
    unsigned char field_2;
    unsigned char field_3;
    int m_nKeyboardKey;
    short field_8;
    short field_10;
    int field_12;
    unsigned char field_16;
    unsigned char field_17;
    unsigned char field_18;
    unsigned char field_19;
    short field_20;
    short field_22;
    short field_24;
    unsigned char field_26;
    unsigned char field_27;
    unsigned char field_28;
    unsigned char field_29;
    unsigned char field_30;
    unsigned char field_31;
    unsigned char field_32;
    unsigned char field_33;
    unsigned char field_34;
    unsigned char field_35;
    unsigned char field_36;
    unsigned char field_37;
    unsigned char field_38;
    unsigned char field_39;
    unsigned char field_40;
    unsigned char field_41;
    short field_42;
    short field_44;
    unsigned char m_nIndex;
    unsigned char field_47;
    unsigned char field_48;
    unsigned char field_49;
    char field_50;
    char field_51;
    int field_52;
    int field_56;
    int field_60;
    char field_64;
    char field_65;
    char field_66;
    char field_67;
    int m_nDeathReason; // eDeathReason
    unsigned char field_72;
    char field_73;
    char field_74;
    char field_75;
    void* field_76;
    void* field_80;
    CCar* m_pLastCars[3];
    int field_96;
    unsigned char field_100;
    char field_101;
    char field_102;
    char field_103;
    int field_104;
    int m_bProcessDebugControls;
    bool m_bNumpadUp;
    bool m_bNumpadDown;
    bool m_bNumpadLeft;
    bool m_bNumpadRight;
    bool m_bNumpadPageDown;
    bool m_bNumpadPageUp;
    bool m_bPageDown;
    bool m_bPageUp;
    bool m_bButtonForward;
    bool m_bButtonBackward;
    bool m_bButtonLeft;
    bool m_bButtonRight;
    bool m_bButtonAttack;
    bool m_bButtonEnterExit;
    bool m_bButtonHandbrakeJump;
    bool m_bButtonPrevWeapon;
    bool m_bButtonNextWeapon;
    bool m_bButtonSpecial;
    bool m_bButtonSpecial2;
    bool field_131;
    bool m_bOldButtonSpecial;
    bool m_bOldButtonSpecial2;
    bool field_134;
    bool m_bOldButtonNextWeapon;
    bool m_bOldButtonPrevWeapon;
    bool m_bOldButtonEnterExit;
    bool m_bOldButtonHandbrakeJump;
    bool m_bOldButtonForward;
    bool m_bOldButtonBackward;
    bool m_bOldButtonAttack;
    bool m_bProcess;
    bool m_bFired;
    CCamera m_GameCamera; 
    CCamera m_ViewCamera;
    CCamera m_AuxCamera;
    CPed* m_pPed;
    void* field_712;
    void* field_716;
    char field_720;
    char field_721;
    char field_722;
    char field_723;
    tCounter m_MoneyCounter;
    char field_1593[820];
    unsigned char field_1600;
    char field_1601;
    char field_1602;
    char field_1603;
    void* field_1604;
    char field_1608[48];
    int field_1656;
    int field_1660;
    unsigned short field_1662;
    unsigned short field_1664;
    tCounter m_Lives;
    tCounter m_MoneyMultiplier;
    unsigned char field_1780;
    unsigned char field_1781;
    unsigned char field_1782;
    unsigned char field_1783;
    unsigned char field_1784;
    unsigned char field_1785;
    unsigned char m_nArmor;
    unsigned char field_1787[140];
    unsigned short field_1928;
    unsigned char m_bShowGameQuitText;
    unsigned char field_1931;
    unsigned int field_1932;
    unsigned short field_1936;
    unsigned char field_1937;
    unsigned char field_1938;
    unsigned char field_1939;
    unsigned char field_1940;
    unsigned char field_1941;
    unsigned char field_1942;
    unsigned char field_1943[196];

public:
    CPlayerPed(char index);
    ~CPlayerPed();
    void SetInitialState();
    void Teleport(int x, int y, int z);
    void GiveMoney(unsigned int money);
    bool IsKeyJustDown(int key);
    bool IsKeyDown(int key);
    bool IsKeyUp(int key);
    void ProcessKeyPresses(unsigned short key);
    void ProcessActions(char forward, char backward, char left, char right, char prevWeap, char nextWeap);
    void Process();
    void SetPed(CPed* ped);
    CPed* GetPed();
    void SetAllControlStatusOff();
    void SetAllControlStatusOn();
    void SetEnterControlStatusOff();
    void SetEnterControlStatusOn();
    CCamera* GetAuxCamera();
};
VALIDATE_OFFSET(CPlayerPed, field_0, 0x0);
VALIDATE_OFFSET(CPlayerPed, field_1, 0x1);
VALIDATE_OFFSET(CPlayerPed, field_2, 0x2);
VALIDATE_OFFSET(CPlayerPed, field_3, 0x3);
VALIDATE_OFFSET(CPlayerPed, m_nKeyboardKey, 0x4);
VALIDATE_OFFSET(CPlayerPed, field_8, 0x8);
VALIDATE_OFFSET(CPlayerPed, field_10, 0xA);
VALIDATE_OFFSET(CPlayerPed, field_12, 0xC);
VALIDATE_OFFSET(CPlayerPed, field_16, 0x10);
VALIDATE_OFFSET(CPlayerPed, field_17, 0x11);
VALIDATE_OFFSET(CPlayerPed, field_18, 0x12);
VALIDATE_OFFSET(CPlayerPed, field_19, 0x13);
VALIDATE_OFFSET(CPlayerPed, field_20, 0x14);
VALIDATE_OFFSET(CPlayerPed, field_22, 0x16);
VALIDATE_OFFSET(CPlayerPed, field_24, 0x18);
VALIDATE_OFFSET(CPlayerPed, field_26, 0x1A);
VALIDATE_OFFSET(CPlayerPed, field_27, 0x1B);
VALIDATE_OFFSET(CPlayerPed, field_28, 0x1C);
VALIDATE_OFFSET(CPlayerPed, field_29, 0x1D);
VALIDATE_OFFSET(CPlayerPed, field_30, 0x1E);
VALIDATE_OFFSET(CPlayerPed, field_31, 0x1F);
VALIDATE_OFFSET(CPlayerPed, field_32, 0x20);
VALIDATE_OFFSET(CPlayerPed, field_33, 0x21);
VALIDATE_OFFSET(CPlayerPed, field_34, 0x22);
VALIDATE_OFFSET(CPlayerPed, field_35, 0x23);
VALIDATE_OFFSET(CPlayerPed, field_36, 0x24);
VALIDATE_OFFSET(CPlayerPed, field_37, 0x25);
VALIDATE_OFFSET(CPlayerPed, field_38, 0x26);
VALIDATE_OFFSET(CPlayerPed, field_39, 0x27);
VALIDATE_OFFSET(CPlayerPed, field_40, 0x28);
VALIDATE_OFFSET(CPlayerPed, field_41, 0x29);
VALIDATE_OFFSET(CPlayerPed, field_42, 0x2A);
VALIDATE_OFFSET(CPlayerPed, field_44, 0x2C);
VALIDATE_OFFSET(CPlayerPed, m_nIndex, 0x2E);
VALIDATE_OFFSET(CPlayerPed, field_47, 0x2F);
VALIDATE_OFFSET(CPlayerPed, field_48, 0x30);
VALIDATE_OFFSET(CPlayerPed, field_49, 0x31);
VALIDATE_OFFSET(CPlayerPed, field_50, 0x32);
VALIDATE_OFFSET(CPlayerPed, field_51, 0x33);
VALIDATE_OFFSET(CPlayerPed, field_52, 0x34);
VALIDATE_OFFSET(CPlayerPed, field_56, 0x38);
VALIDATE_OFFSET(CPlayerPed, field_60, 0x3C);
VALIDATE_OFFSET(CPlayerPed, field_64, 0x40);
VALIDATE_OFFSET(CPlayerPed, field_65, 0x41);
VALIDATE_OFFSET(CPlayerPed, field_66, 0x42);
VALIDATE_OFFSET(CPlayerPed, field_67, 0x43);
VALIDATE_OFFSET(CPlayerPed, m_nDeathReason, 0x44);
VALIDATE_OFFSET(CPlayerPed, field_72, 0x48);
VALIDATE_OFFSET(CPlayerPed, field_73, 0x49);
VALIDATE_OFFSET(CPlayerPed, field_74, 0x4A);
VALIDATE_OFFSET(CPlayerPed, field_75, 0x4B);
VALIDATE_OFFSET(CPlayerPed, field_76, 0x4C);
VALIDATE_OFFSET(CPlayerPed, field_80, 0x50);
VALIDATE_OFFSET(CPlayerPed, m_pLastCars, 0x54);
VALIDATE_OFFSET(CPlayerPed, field_96, 0x60);
VALIDATE_OFFSET(CPlayerPed, field_100, 0x64);
VALIDATE_OFFSET(CPlayerPed, field_101, 0x65);
VALIDATE_OFFSET(CPlayerPed, field_102, 0x66);
VALIDATE_OFFSET(CPlayerPed, field_103, 0x67);
VALIDATE_OFFSET(CPlayerPed, field_104, 0x68);
VALIDATE_OFFSET(CPlayerPed, m_bProcessDebugControls, 0x6C);
VALIDATE_OFFSET(CPlayerPed, m_bNumpadUp, 0x70);
VALIDATE_OFFSET(CPlayerPed, m_bNumpadDown, 0x71);
VALIDATE_OFFSET(CPlayerPed, m_bNumpadLeft, 0x72);
VALIDATE_OFFSET(CPlayerPed, m_bNumpadRight, 0x73);
VALIDATE_OFFSET(CPlayerPed, m_bNumpadPageDown, 0x74);
VALIDATE_OFFSET(CPlayerPed, m_bNumpadPageUp, 0x75);
VALIDATE_OFFSET(CPlayerPed, m_bPageDown, 0x76);
VALIDATE_OFFSET(CPlayerPed, m_bPageUp, 0x77);
VALIDATE_OFFSET(CPlayerPed, m_bButtonForward, 0x78);
VALIDATE_OFFSET(CPlayerPed, m_bButtonBackward, 0x79);
VALIDATE_OFFSET(CPlayerPed, m_bButtonLeft, 0x7A);
VALIDATE_OFFSET(CPlayerPed, m_bButtonRight, 0x7B);
VALIDATE_OFFSET(CPlayerPed, m_bButtonAttack, 0x7C);
VALIDATE_OFFSET(CPlayerPed, m_bButtonEnterExit, 0x7D);
VALIDATE_OFFSET(CPlayerPed, m_bButtonHandbrakeJump, 0x7E);
VALIDATE_OFFSET(CPlayerPed, m_bButtonPrevWeapon, 0x7F);
VALIDATE_OFFSET(CPlayerPed, m_bButtonNextWeapon, 0x80);
VALIDATE_OFFSET(CPlayerPed, m_bButtonSpecial, 0x81);
VALIDATE_OFFSET(CPlayerPed, m_bButtonSpecial2, 0x82);
VALIDATE_OFFSET(CPlayerPed, field_131, 0x83);
VALIDATE_OFFSET(CPlayerPed, m_bOldButtonSpecial, 0x84);
VALIDATE_OFFSET(CPlayerPed, m_bOldButtonSpecial2, 0x85);
VALIDATE_OFFSET(CPlayerPed, field_134, 0x86);
VALIDATE_OFFSET(CPlayerPed, m_bOldButtonNextWeapon, 0x87);
VALIDATE_OFFSET(CPlayerPed, m_bOldButtonPrevWeapon, 0x88);
VALIDATE_OFFSET(CPlayerPed, m_bOldButtonEnterExit, 0x89);
VALIDATE_OFFSET(CPlayerPed, m_bOldButtonHandbrakeJump, 0x8A);
VALIDATE_OFFSET(CPlayerPed, m_bOldButtonForward, 0x8B);
VALIDATE_OFFSET(CPlayerPed, m_bOldButtonBackward, 0x8C);
VALIDATE_OFFSET(CPlayerPed, m_bOldButtonAttack, 0x8D);
VALIDATE_OFFSET(CPlayerPed, m_bProcess, 0x8E);
VALIDATE_OFFSET(CPlayerPed, m_bFired, 0x8F);
VALIDATE_OFFSET(CPlayerPed, m_GameCamera, 0x90);
VALIDATE_OFFSET(CPlayerPed, m_ViewCamera, 0x14C);
VALIDATE_OFFSET(CPlayerPed, m_AuxCamera, 0x208);
VALIDATE_OFFSET(CPlayerPed, m_pPed, 0x2C4);
VALIDATE_OFFSET(CPlayerPed, field_712, 0x2C8);
VALIDATE_OFFSET(CPlayerPed, field_716, 0x2CC);
VALIDATE_OFFSET(CPlayerPed, field_720, 0x2D0);
VALIDATE_OFFSET(CPlayerPed, field_721, 0x2D1);
VALIDATE_OFFSET(CPlayerPed, field_722, 0x2D2);
VALIDATE_OFFSET(CPlayerPed, field_723, 0x2D3);
VALIDATE_OFFSET(CPlayerPed, m_MoneyCounter, 0x2D4);
VALIDATE_OFFSET(CPlayerPed, field_1593, 0x30C);
VALIDATE_OFFSET(CPlayerPed, field_1600, 0x640);
VALIDATE_OFFSET(CPlayerPed, field_1601, 0x641);
VALIDATE_OFFSET(CPlayerPed, field_1602, 0x642);
VALIDATE_OFFSET(CPlayerPed, field_1603, 0x643);
VALIDATE_OFFSET(CPlayerPed, field_1604, 0x644);
VALIDATE_OFFSET(CPlayerPed, field_1608, 0x648);
VALIDATE_OFFSET(CPlayerPed, field_1656, 0x678);
VALIDATE_OFFSET(CPlayerPed, field_1660, 0x67C);
VALIDATE_OFFSET(CPlayerPed, field_1662, 0x680);
VALIDATE_OFFSET(CPlayerPed, field_1664, 0x682);
VALIDATE_OFFSET(CPlayerPed, m_Lives, 0x684);
VALIDATE_OFFSET(CPlayerPed, m_MoneyMultiplier, 0x6BC);
VALIDATE_OFFSET(CPlayerPed, field_1780, 0x6F4);
VALIDATE_OFFSET(CPlayerPed, field_1781, 0x6F5);
VALIDATE_OFFSET(CPlayerPed, field_1782, 0x6F6);
VALIDATE_OFFSET(CPlayerPed, field_1783, 0x6F7);
VALIDATE_OFFSET(CPlayerPed, field_1784, 0x6F8);
VALIDATE_OFFSET(CPlayerPed, field_1785, 0x6F9);
VALIDATE_OFFSET(CPlayerPed, m_nArmor, 0x6FA);
VALIDATE_OFFSET(CPlayerPed, field_1787, 0x6FB);
VALIDATE_OFFSET(CPlayerPed, field_1928, 0x788);
VALIDATE_OFFSET(CPlayerPed, m_bShowGameQuitText, 0x78A);
VALIDATE_OFFSET(CPlayerPed, field_1931, 0x78B);
VALIDATE_OFFSET(CPlayerPed, field_1932, 0x78C);
VALIDATE_OFFSET(CPlayerPed, field_1936, 0x790);
VALIDATE_OFFSET(CPlayerPed, field_1937, 0x792);
VALIDATE_OFFSET(CPlayerPed, field_1938, 0x793);
VALIDATE_OFFSET(CPlayerPed, field_1939, 0x794);
VALIDATE_OFFSET(CPlayerPed, field_1940, 0x795);
VALIDATE_OFFSET(CPlayerPed, field_1941, 0x796);
VALIDATE_OFFSET(CPlayerPed, field_1942, 0x797);
VALIDATE_OFFSET(CPlayerPed, field_1943, 0x798);
VALIDATE_SIZE(CPlayerPed, 0x85C);
