/*
    Plugin-SDK (Grand Theft Auto 2) header file
    Authors: GTA Community. See more here
    https://github.com/DK22Pac/plugin-sdk
    Do not delete this comment block. Respect others' work!
*/
#pragma once
#include "PluginBase.h"
#include <ddraw.h>
#include <d3d.h>

struct tDevice {
    unsigned long id;
    unsigned long flags;
    char* driverName;
    char* driverDesc;
    tDevice* next;
    GUID* guid;
    GUID field_18;
    unsigned long totalVideoMemory;
    unsigned long buffer;
};
VALIDATE_OFFSET(tDevice, id, 0x0);
VALIDATE_OFFSET(tDevice, flags, 0x4);
VALIDATE_OFFSET(tDevice, driverName, 0x8);
VALIDATE_OFFSET(tDevice, driverDesc, 0xC);
VALIDATE_OFFSET(tDevice, next, 0x10);
VALIDATE_OFFSET(tDevice, guid, 0x14);
VALIDATE_OFFSET(tDevice, field_18, 0x18);
VALIDATE_OFFSET(tDevice, totalVideoMemory, 0x28);
VALIDATE_OFFSET(tDevice, buffer, 0x2C);
VALIDATE_SIZE(tDevice, 0x30);

struct tDisplayMode {
    unsigned long displayModeIndex;
    unsigned long deviceId;
    unsigned long width;
    unsigned long height;
    unsigned long pitch;
    unsigned long bits;
    unsigned long field_18;
    unsigned long field_1C;
    unsigned long field_20;
    unsigned long field_24;
    unsigned long field_28;
    unsigned long field_2C;
    unsigned long field_30;
    unsigned long field_34;
    tDisplayMode* field_38;
    unsigned long field_3C;
};
VALIDATE_OFFSET(tDisplayMode, displayModeIndex, 0x0);
VALIDATE_OFFSET(tDisplayMode, deviceId, 0x4);
VALIDATE_OFFSET(tDisplayMode, width, 0x8);
VALIDATE_OFFSET(tDisplayMode, height, 0xC);
VALIDATE_OFFSET(tDisplayMode, pitch, 0x10);
VALIDATE_OFFSET(tDisplayMode, bits, 0x14);
VALIDATE_OFFSET(tDisplayMode, field_18, 0x18);
VALIDATE_OFFSET(tDisplayMode, field_1C, 0x1C);
VALIDATE_OFFSET(tDisplayMode, field_20, 0x20);
VALIDATE_OFFSET(tDisplayMode, field_24, 0x24);
VALIDATE_OFFSET(tDisplayMode, field_28, 0x28);
VALIDATE_OFFSET(tDisplayMode, field_2C, 0x2C);
VALIDATE_OFFSET(tDisplayMode, field_30, 0x30);
VALIDATE_OFFSET(tDisplayMode, field_34, 0x34);
VALIDATE_OFFSET(tDisplayMode, field_38, 0x38);
VALIDATE_OFFSET(tDisplayMode, field_3C, 0x3C);
VALIDATE_SIZE(tDisplayMode, 0x40);

struct tVidVersion {
    unsigned long version;
    char versionString[255];
};
VALIDATE_OFFSET(tVidVersion, version, 0x0);
VALIDATE_OFFSET(tVidVersion, versionString, 0x4);
VALIDATE_SIZE(tVidVersion, 0x104);

struct tVideoFunctions;

struct tVideo {
    unsigned long field_0;
    unsigned long flags;
    unsigned long width;
    unsigned long height;
    unsigned long bits;
    unsigned long displayMode;
    unsigned long field_18;
    unsigned long field_1C;
    unsigned long field_20;
    tDisplayMode* field_24;
    tDisplayMode* field_28;
    tDevice* field_2C;
    tDevice* field_30;
    unsigned long field_34;
    unsigned long field_38;
    tDisplayMode* field_3C;
    unsigned long full_screen;
    unsigned long field_44;
    unsigned long field_48;
    unsigned long field_4C;
    void* pixels;
    unsigned long pitch;
    unsigned long field_58;
    unsigned long field_5C;
    unsigned long field_60;
    unsigned long field_64;
    unsigned long field_68;
    unsigned long field_6C;
    unsigned long field_70;
    unsigned long field_74;
    unsigned long field_78;
    HINSTANCE handle;
    unsigned long activeMode;
    tVideoFunctions* field_84;
    unsigned long lastError;
    IDirectDraw7* ddraw7;
    char buffer[144];
    IDirectDraw4* ddraw4;
    GUID field_124;
    IDirectDrawSurface4* surfacePrimary;
    IDirectDrawSurface4* surface;
    DDSURFACEDESC2 surfaceDesc;
    LPDIRECTDRAWCLIPPER clipper;
    unsigned long field_1BC;
    unsigned long field_1C0;
    unsigned long field_1C4;
    DDCAPS caps;
    DDCAPS field_344;
    HWND hwnd;
};
VALIDATE_OFFSET(tVideo, field_0, 0x0);
VALIDATE_OFFSET(tVideo, flags, 0x4);
VALIDATE_OFFSET(tVideo, width, 0x8);
VALIDATE_OFFSET(tVideo, height, 0xC);
VALIDATE_OFFSET(tVideo, bits, 0x10);
VALIDATE_OFFSET(tVideo, displayMode, 0x14);
VALIDATE_OFFSET(tVideo, field_18, 0x18);
VALIDATE_OFFSET(tVideo, field_1C, 0x1C);
VALIDATE_OFFSET(tVideo, field_20, 0x20);
VALIDATE_OFFSET(tVideo, field_24, 0x24);
VALIDATE_OFFSET(tVideo, field_28, 0x28);
VALIDATE_OFFSET(tVideo, field_2C, 0x2C);
VALIDATE_OFFSET(tVideo, field_30, 0x30);
VALIDATE_OFFSET(tVideo, field_34, 0x34);
VALIDATE_OFFSET(tVideo, field_38, 0x38);
VALIDATE_OFFSET(tVideo, field_3C, 0x3C);
VALIDATE_OFFSET(tVideo, full_screen, 0x40);
VALIDATE_OFFSET(tVideo, field_44, 0x44);
VALIDATE_OFFSET(tVideo, field_48, 0x48);
VALIDATE_OFFSET(tVideo, field_4C, 0x4C);
VALIDATE_OFFSET(tVideo, pixels, 0x50);
VALIDATE_OFFSET(tVideo, pitch, 0x54);
VALIDATE_OFFSET(tVideo, field_58, 0x58);
VALIDATE_OFFSET(tVideo, field_5C, 0x5C);
VALIDATE_OFFSET(tVideo, field_60, 0x60);
VALIDATE_OFFSET(tVideo, field_64, 0x64);
VALIDATE_OFFSET(tVideo, field_68, 0x68);
VALIDATE_OFFSET(tVideo, field_6C, 0x6C);
VALIDATE_OFFSET(tVideo, field_70, 0x70);
VALIDATE_OFFSET(tVideo, field_74, 0x74);
VALIDATE_OFFSET(tVideo, field_78, 0x78);
VALIDATE_OFFSET(tVideo, handle, 0x7C);
VALIDATE_OFFSET(tVideo, activeMode, 0x80);
VALIDATE_OFFSET(tVideo, field_84, 0x84);
VALIDATE_OFFSET(tVideo, lastError, 0x88);
VALIDATE_OFFSET(tVideo, ddraw7, 0x8C);
VALIDATE_OFFSET(tVideo, buffer, 0x90);
VALIDATE_OFFSET(tVideo, ddraw4, 0x120);
VALIDATE_OFFSET(tVideo, field_124, 0x124);
VALIDATE_OFFSET(tVideo, surfacePrimary, 0x134);
VALIDATE_OFFSET(tVideo, surface, 0x138);
VALIDATE_OFFSET(tVideo, surfaceDesc, 0x13C);
VALIDATE_OFFSET(tVideo, clipper, 0x1B8);
VALIDATE_OFFSET(tVideo, field_1BC, 0x1BC);
VALIDATE_OFFSET(tVideo, field_1C0, 0x1C0);
VALIDATE_OFFSET(tVideo, field_1C4, 0x1C4);
VALIDATE_OFFSET(tVideo, caps, 0x1C8);
VALIDATE_OFFSET(tVideo, field_344, 0x344);
VALIDATE_OFFSET(tVideo, hwnd, 0x4C0);
VALIDATE_SIZE(tVideo, 0x4C4);

typedef tVidVersion(__stdcall* T_Vid_GetVersion)();
typedef tVideo(__stdcall* T_Vid_Init_SYS)(HINSTANCE hInstance, unsigned short flags);
typedef int(__stdcall* T_Vid_CheckMode)(tVideo* pVideoDriver, int width, int height, int rgbBitCount);
typedef tDevice(__stdcall* T_Vid_FindDevice)(tVideo* pVideoDriver, int deviceId);
typedef tDisplayMode(__stdcall* T_Vid_FindMode)(tVideo* pVideoDriver, int mode);
typedef int(__stdcall* T_Vid_FindFirstMode)(tVideo* pVideoDriver, int rgbBitCountFilter);
typedef int(__stdcall* T_Vid_FindNextMode)(tVideo* pVideoDriver);
typedef void(__stdcall* T_Vid_CloseScreen)(tVideo* pVideoDriver);
typedef int(__stdcall* T_Vid_SetDevice)(tVideo* pVideoDriver, int deviceId);
typedef int(__stdcall* T_Vid_SetMode)(tVideo* pVideoDriver, HWND hWnd, int modeId);
typedef void(__stdcall* T_Vid_GrabSurface)(tVideo* pVideoDriver);
typedef void(__stdcall* T_Vid_ReleaseSurface)(tVideo* pVideoDriver);
typedef void(__stdcall* T_Vid_FlipBuffers)(tVideo* pVideoDriver);
typedef void(__stdcall* T_Vid_ShutDown_SYS)(tVideo* pVideoDriver);
typedef int(__stdcall* T_Vid_EnableWrites)(tVideo* pVideoDriver);
typedef int(__stdcall* T_Vid_DisableWrites)(tVideo* pVideoDriver);
typedef int(__stdcall* T_Vid_GetSurface)(tVideo* pVideoDriver);
typedef int(__stdcall* T_Vid_FreeSurface)(tVideo* pVideoDriver);
typedef int(__stdcall* T_Vid_ClearScreen)(tVideo* pVideoDriver, unsigned char aR, unsigned char aG, unsigned char aB, int aLeft, int aTop, int aRight, int aBottom);
typedef int(__stdcall* T_Vid_SetGamma)(tVideo* pVideoDriver, float a2, float a3, float a4);
typedef int(__stdcall* T_Vid_WindowProc)(tVideo* pVideoDriver, HWND hwnd, DWORD uMsg, WPARAM wParam, LPARAM lParam);
typedef int(__stdcall* T_Vid_InitDLL)(HINSTANCE hInstance, tVideoFunctions* a2);

struct tVideoFunctions {
    T_Vid_GetVersion* pVid_GetVersion;
    T_Vid_Init_SYS* pVid_Init_SYS;
    T_Vid_CheckMode* pVid_CheckMode;
    T_Vid_FindMode* pVid_FindMode;
    T_Vid_FindFirstMode* pVid_FindFirstMode;
    T_Vid_FindNextMode* pVid_FindNextMode;
    T_Vid_FindDevice* pVid_FindDevice;
    T_Vid_SetDevice* pVid_SetDevice;
    T_Vid_CloseScreen* pVid_CloseScreen;
    T_Vid_SetMode* pVid_SetMode;
    T_Vid_FlipBuffers* pVid_FlipBuffers;
    T_Vid_ReleaseSurface* pVid_ReleaseSurface;
    T_Vid_GrabSurface* pVid_GrabSurface;
    T_Vid_ShutDown_SYS* pVid_ShutDown_SYS;
    T_Vid_EnableWrites* pVid_EnableWrites;
    T_Vid_DisableWrites* pVid_DisableWrites;
    T_Vid_GetSurface* pVid_GetSurface;
    T_Vid_FreeSurface* pVid_FreeSurface;
    T_Vid_ClearScreen* pVid_ClearScreen;
    T_Vid_WindowProc* pVid_WindowProc;
    T_Vid_InitDLL* pVid_InitDLL;
    T_Vid_SetGamma* pVid_SetGamma;
};
VALIDATE_OFFSET(tVideoFunctions, pVid_GetVersion, 0x0);
VALIDATE_OFFSET(tVideoFunctions, pVid_Init_SYS, 0x4);
VALIDATE_OFFSET(tVideoFunctions, pVid_CheckMode, 0x8);
VALIDATE_OFFSET(tVideoFunctions, pVid_FindMode, 0xC);
VALIDATE_OFFSET(tVideoFunctions, pVid_FindFirstMode, 0x10);
VALIDATE_OFFSET(tVideoFunctions, pVid_FindNextMode, 0x14);
VALIDATE_OFFSET(tVideoFunctions, pVid_FindDevice, 0x18);
VALIDATE_OFFSET(tVideoFunctions, pVid_SetDevice, 0x1C);
VALIDATE_OFFSET(tVideoFunctions, pVid_CloseScreen, 0x20);
VALIDATE_OFFSET(tVideoFunctions, pVid_SetMode, 0x24);
VALIDATE_OFFSET(tVideoFunctions, pVid_FlipBuffers, 0x28);
VALIDATE_OFFSET(tVideoFunctions, pVid_ReleaseSurface, 0x2C);
VALIDATE_OFFSET(tVideoFunctions, pVid_GrabSurface, 0x30);
VALIDATE_OFFSET(tVideoFunctions, pVid_ShutDown_SYS, 0x34);
VALIDATE_OFFSET(tVideoFunctions, pVid_EnableWrites, 0x38);
VALIDATE_OFFSET(tVideoFunctions, pVid_DisableWrites, 0x3C);
VALIDATE_OFFSET(tVideoFunctions, pVid_GetSurface, 0x40);
VALIDATE_OFFSET(tVideoFunctions, pVid_FreeSurface, 0x44);
VALIDATE_OFFSET(tVideoFunctions, pVid_ClearScreen, 0x48);
VALIDATE_OFFSET(tVideoFunctions, pVid_WindowProc, 0x4C);
VALIDATE_OFFSET(tVideoFunctions, pVid_InitDLL, 0x50);
VALIDATE_OFFSET(tVideoFunctions, pVid_SetGamma, 0x54);
VALIDATE_SIZE(tVideoFunctions, 0x58);

extern T_Vid_GetVersion& Vid_GetVersion;
extern T_Vid_Init_SYS& Vid_Init_SYS;
extern T_Vid_CheckMode& Vid_CheckMode;
extern T_Vid_FindMode& Vid_FindMode;
extern T_Vid_FindFirstMode& Vid_FindFirstMode;
extern T_Vid_FindNextMode& Vid_FindNextMode;
extern T_Vid_FindDevice& Vid_FindDevice;
extern T_Vid_SetDevice& Vid_SetDevice;
extern T_Vid_CloseScreen& Vid_CloseScreen;
extern T_Vid_SetMode& Vid_SetMode;
extern T_Vid_FlipBuffers& Vid_FlipBuffers;
extern T_Vid_ReleaseSurface& Vid_ReleaseSurface;
extern T_Vid_GrabSurface& Vid_GrabSurface;
extern T_Vid_ShutDown_SYS& Vid_ShutDown_SYS;
extern T_Vid_EnableWrites& Vid_EnableWrites;
extern T_Vid_DisableWrites& Vid_DisableWrites;
extern T_Vid_GetSurface& Vid_GetSurface;
extern T_Vid_FreeSurface& Vid_FreeSurface;
extern T_Vid_ClearScreen& Vid_ClearScreen;
extern T_Vid_WindowProc& Vid_WindowProc;
extern T_Vid_InitDLL& Vid_InitDLL;
extern T_Vid_SetGamma& Vid_SetGamma;

extern tVideo** gVidSys;
extern tVideo* GetVideoSystem();
extern void ResetVideoDevice();
